# **LeetCode SQL Question Summary**

Write a SQL query for a report that provides the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.
ActorDirector table:
+-------------+-------------+-------------+
| actor_id    | director_id | timestamp   |
+-------------+-------------+-------------+
| 1           | 1           | 0           |
| 1           | 1           | 1           |
| 1           | 1           | 2           |
| 1           | 2           | 3           |
| 1           | 2           | 4           |
| 2           | 1           | 5           |
| 2           | 1           | 6           |
+-------------+-------------+-------------+
Result table: 
+-------------+-------------+
| actor_id    | director_id |
+-------------+-------------+
| 1           | 1           |
+-------------+-------------+
Explanation: The only pair is (1, 1) where they cooperated exactly 3 times.

## 175.[Easy] Combine Two Tables

***Write an SQL query to report the first name, last name, city, and state of each person in the Person table.<br/>
If the address of a personId is not present in the Address table, report null instead.***

Person table:
| personId | lastName | firstName | 
|:--------:|:--------:|:---------:| 
| 1        | Wang     | Allen     | 
| 2        | Alice    | Bob       | 

Address table:
| addressId | personId | city          | state      |
|:---------:|:--------:|:-------------:|:----------:|
| 1         | 2        | New York City | New York   |
| 2         | 3        | Leetcode      | California |

Output: 
| firstName | lastName | city          | state    |
|:---------:|:--------:|:-------------:|:--------:|
| Allen     | Wang     | Null          | Null     |
| Bob       | Alice    | New York City | New York |

Explanation:<br/>
There is no address in the address table for the personId = 1 so we return null in their city and state.<br/>
addressId = 1 contains information about the address of personId = 2.

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Person;
CREATE TABLE Person (personId int, firstName varchar(255), lastName varchar(255));
INSERT INTO Person (personId, lastName, firstName) VALUES 
('1', 'Wang', 'Allen'),
('2', 'Alice', 'Bob');

DROP TABLE IF EXISTS Address;
CREATE TABLE Address (addressId int, personId int, city varchar(255), state varchar(255));
INSERT INTO Address (addressId, personId, city, state) VALUES
('1', '2', 'New York City', 'New York'),
('2', '3', 'Leetcode', 'California');

-- Write your MySQL query statement below
SELECT p.firstName, p.lastName, a.city, a.state
FROM Person p LEFT JOIN Address a
ON p.personId = a.personId

## 176.[Easy] Second Highest Salary

***Write an SQL query to report the second highest salary from the Employee table.<br/>
If there is no second highest salary, the query should report null.***

Employee table:
| id | salary |
|:--:|:------:|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

Output:
| SecondHighestSalary |
|:-------------------:|
| 200                 |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (id INT, salary INT);
INSERT INTO Employee (id, salary) VALUES
    ('1', '100'),
    ('2', '200'),
    ('3', '300'),
    ('4', '300');
    
-- Write your MySQL query statement below
-- #1 WHERE, MAX
SELECT MAX(salary) AS SecondHighestSalary
FROM Employee
WHERE salary < (SELECT MAX(salary)
				FROM Employee);
                
-- #2 LIMIT, OFFSET
SELECT IFNULL((SELECT DISTINCT salary 
        FROM Employee
        ORDER BY salary DESC
        LIMIT 1 OFFSET 1), NULL) AS SecondHighestSalary; 
        -- LIMIT 1, 1 (# rows to skip (offset), # rows to show)
        
-- #3 DENSE_RANK()
SELECT IFNULL((SELECT DISTINCT salary 
               FROM (SELECT salary,
	                 DENSE_RANK() OVER(ORDER BY salary DESC) AS 'nb_dense_rank'
					 FROM Employee) AS temp
			   WHERE nb_dense_rank = 2), NULL) AS SecondHighestSalary;

## 177.[Medium] Nth Highest Salary

***Write an SQL query to report the nth highest salary from the Employee table.<br/>
If there is no nth highest salary, the query should report null.***

Employee table:
| id | salary |
|:--:|:------:|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

n = 2

Output: 
| getNthHighestSalary(2) |
|:----------------------:|
| 200                    |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee(Id int, Salary int);
INSERT INTO Employee (id, salary) VALUES 
    ('1', '100'),
	('2', '200'),
	('3', '300');

-- Writing your MySQL statement below
SELECT salary AS "gerNthHighestSalary(2)"
FROM (SELECT *, IFNULL(DENSE_RANK() OVER(ORDER BY salary DESC), NULL) AS n
	  FROM Employee) AS temp
WHERE n = 2;

## 178.[Medium] Rank Scores

***Write an SQL query to rank the scores. The ranking should be calculated according to the following rules:***<br/>
- ***The scores should be ranked from the highest to the lowest.***
- ***If there is a tie between two scores, both should have the same ranking.***
- ***After a tie, the next ranking number should be the next consecutive integer value.***<br/>
  ***In other words, there should be no holes between ranks.***
- ***Return the result table ordered by score in descending order.***

Input:<br/>
Scores table:
| id | score |
|:--:|:-----:|
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |
| 6  | 3.65  |

Output: 

| score | rank |
|:-----:|:----:|
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
| 3.65  | 3    |
| 3.65  | 3    |
| 3.50  | 4    |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Scores;
CREATE TABLE Scores (id INT, score DECIMAL(3,2));
INSERT INTO Scores (id, score) VALUES
    ('1', '3.5'),
    ('2', '3.65'),
    ('3', '4.0'),
    ('4', '3.85'),
    ('5', '4.0'),
    ('6', '3.65');

-- Write your MySQL query statement below
-- #1 DENSE_RANK()
SELECT score,
	   DENSE_RANK() OVER(ORDER BY score DESC) AS 'rank'
FROM Scores;

-- #2 COUNT, WHERE, ORDER BY
SELECT score,
	  (SELECT COUNT(DISTINCT score) 
	   FROM Scores 
	   WHERE score >= s.score) AS 'rank'
FROM Scores s
ORDER BY Score DESC;

## 180.[Medium] Consecutive Numbers

***Write an SQL query to find all numbers that appear at least three times consecutively.***

Input:<br/>
Logs table:
| id | num |
|:--:|:---:|
| 1  | 1   |
| 2  | 1   |
| 3  | 1   |
| 4  | 2   |
| 5  | 1   |
| 6  | 2   |
| 7  | 2   |

Output: 
| ConsecutiveNums |
|:---------------:|
| 1               |

Explanation: 1 is the only number that appears consecutively for at least three times.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Logs;
CREATE TABLE Logs (id INT, num INT);
INSERT INTO Logs (id, num) VALUES 
    ('1', '1'),
    ('2', '1'),
    ('3', '1'),
    ('4', '2'),
    ('5', '1'),
    ('6', '2'),
    ('7', '2');

-- Write your MySQL query statement below
-- #1 Selft Join 3 tables
SELECT DISTINCT tb1.num AS ConsecutiveNums
FROM Logs AS tb1
LEFT JOIN Logs AS tb2
ON tb1.id + 1 = tb2.id
LEFT JOIN Logs AS tb3
ON tb2.id + 1 = tb3.id -- ON tb1.id + 2 = tb3.id
WHERE tb1.num = tb2.num 
AND tb2.num = tb3.num;  -- tb1.num = tb2.num = tb3.num WRONG

-- #2 SELF JOIN
SELECT DISTINCT tb1.num AS ConsecutiveNums
FROM Logs AS tb1, Logs AS tb2, Logs AS tb3
WHERE tb1.id + 1 = tb2.id AND tb2.id + 1 = tb3.id
AND tb1.num = tb2.num AND tb2.num = tb3.num;

-- #3 Window Function Using Lead
SELECT DISTINCT num AS ConsecutiveNums
FROM (SELECT *,
	         LEAD(num) OVER(ORDER BY id) AS Num_2,
			 LEAD(num, 2) OVER(ORDER BY id) AS Num_3
             FROM Logs) AS temp
WHERE Num = Num_2 AND Num_2 = Num_3;

-- #4 Smart way to solve
SELECT DISTINCT Num AS ConsecutiveNums
FROM Logs
WHERE (Id + 1, Num) IN (SELECT * FROM Logs) 
AND (Id + 2, Num) IN (SELECT * FROM Logs);

## 181.[Easy] Employees Earning More Than Their Managers

***Write an SQL query to find the employees who earn more than their managers.***

Input:<br/>
Employee table:
| id | name  | salary | managerId |
|:--:|:-----:|:------:|:---------:|
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | Null      |
| 4  | Max   | 90000  | Null      |

Output: 
| Employee |
|:--------:|
| Joe      |

Explanation: Joe is the only employee who earns more than his manager.

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (Id INT,  name VARCHAR(255), salary INT, managerId INT);
INSERT INTO Employee (Id, name, salary, managerId) VALUES
    (1,'Joe',70000,3),
    (2,'Henry',80000,4),
    (3,'Sam',60000,NULL),
    (4,'Max',90000,NULL);

-- Write your MySQL query statement below
-- Check
SELECT *
FROM Employee e1 
LEFT JOIN Employee e2
ON e1.managerId = e2.Id;

-- Final
SELECT e1.name AS 'Employee' 
FROM Employee AS e1
LEFT JOIN Employee AS e2
ON e1.managerId = e2.id
WHERE e1.salary > e2.salary;

## 182.[Easy] Duplicate Emails

***Write an SQL query to report all the duplicate emails.***

Input:<br/>
Person table:
| id |   email   |
|:--:|:---------:|
| 1  | 'a@b.com' |
| 2  | 'c@d.com' |
| 3  | 'a@b.com' |

Output: 
|   Email   |
|:---------:|
| 'a@b.com' |

Explanation: 'a@b.com' is repeated two times.

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Person;
CREATE TABLE Person (Id INT, Email VARCHAR(100));
INSERT INTO Person (Id, Email) VALUES
    (1,'a@b.com'),
    (2,'c@d.com'),
    (3,'a@b.com');

-- Write your MySQL query statement below
-- Check 
SELECT email AS "Email", COUNT(id)
FROM Person
GROUP BY email;

-- Final
SELECT email AS "Email"
FROM Person
GROUP BY email
HAVING COUNT(id) > 1;

## 183.[Easy] Customers Who Never Order

***Write an SQL query to report all customers who never order anything.***

Input:<br/> 
Customers table:
| id | name  |
|:--:|:-----:|
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |

Orders table:
| id | customerId |
|:--:|:----------:|
| 1  | 3          |
| 2  | 1          |

Output: 
| Customers |
|:---------:|
| Henry     |
| Max       |

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Customers;
CREATE TABLE Customers (Id INT, Name VARCHAR(100));
INSERT INTO Customers (Id, Name) VALUES
    (1,'Joe'),
    (2,'Henry'),
    (3,'Sam'),
    (4,'Max');
    
DROP TABLE IF EXISTS Orders;
CREATE TABLE Orders (Id INT, CustomerId INT);
INSERT INTO Orders (Id, CustomerId) VALUES
    (1,3),
    (2,1);

-- Write your MySQL query statement below
-- Check
SELECT c.Id AS CustomerID, c.Name, o.Id AS OrderID
FROM Customers AS c
LEFT JOIN Orders AS o
ON c.id = o.customerId;

-- Final
SELECT c.name AS 'Customers' 
FROM Customers AS c
LEFT JOIN Orders AS o
ON c.id = o.customerId
WHERE o.id IS NULL;

## 184.[Medium] Department Highest Salary

***Write an SQL query to find employees who have the highest salary in each of the departments.***

Input:<br/>
Employee table:
| id | name  | salary | departmentId |
|:--:|:-----:|:------:|:------------:|
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |

Department table:
| id | name  |
|:--:|:-----:|
| 1  | IT    |
| 2  | Sales |

Output: 
| Department | Employee | Salary |
|:----------:|:--------:|:------:|
| IT         | Jim      | 90000  |
| Sales      | Henry    | 80000  |
| IT         | Max      | 90000  |

Explanation: Max and Jim both have the highest salary in the IT department and Henry has the highest salary in the Sales department.

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (Id INT, Name VARCHAR(100), Salary INT, departmentId INT);
INSERT INTO Employee VALUES
    (1,'Joe',70000,1),
    (2,'Jim',90000,1),
    (3,'Henry',80000,2),
    (4,'Sam',60000,2),
    (5,'Max',90000,1);
    
DROP TABLE IF EXISTS Department;
CREATE TABLE Department (Id INT, Name VARCHAR(100));
INSERT INTO Department (Id, Name) VALUES
    (1,'IT'),
    (2,'Sales');

-- Write your MySQL query statement below
-- Check
SELECT e2.departmentId, MAX(salary)
FROM Employee AS e2
WHERE e1.departmentId = e2.departmentId
GROUP BY e2.departmentId;

-- Final
SELECT d.name AS "Department", e1.name AS "Employee", e1.salary
FROM Employee e1 LEFT JOIN Department d
ON e1.departmentId = d.id
WHERE (d.id, e1.salary) IN (SELECT e2.departmentId, MAX(salary)
                            FROM Employee AS e2
                            WHERE e1.departmentId = e2.departmentId
                            GROUP BY e2.departmentId);

## 185.[Hard] Department Top Three Salaries

***Write a SQL query to find employees who earn the top three salaries in each of the department.***

Input:<br/>
Employee table:
| id | name  | salary | departmentId |
|:--:|:-----:|:------:|:------------:|
| 1  | Joe   | 85000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |
| 7  | Will  | 70000  | 1            |

Department table:
| id | name  |
|:--:|:-----:|
| 1  | IT    |
| 2  | Sales |

Output: 
| Department | Employee | Salary |
|:----------:|:--------:|:------:|
| IT         | Max      | 90000  |
| IT         | Joe      | 85000  |
| IT         | Randy    | 85000  |
| IT         | Will     | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |

Explanation: 
In the IT department:<br/>
- Max earns the highest unique salary
- Both Randy and Joe earn the second-highest unique salary
- Will earns the third-highest unique salary

In the Sales department:<br/>
- Henry earns the highest salary
- Sam earns the second-highest salary
- There is no third-highest salary as there are only two employees

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (Id INT, Name VARCHAR(100), Salary INT, departmentId INT);
INSERT INTO Employee VALUES
    (1,'Joe',85000,1),
    (2,'Henry',80000,2),
    (3,'Sam',60000,2),
    (4,'Max',90000,1),
    (5,'Janet',69000,1),
    (6,'Randy',85000,1),
    (7,'Will',70000,1);

DROP TABLE IF EXISTS Department;
CREATE TABLE Department (Id INT, Name VARCHAR(100));
INSERT INTO Department (Id, Name) VALUES
    (1,'IT'),
    (2,'Sales');

-- Write your MySQL query statement below
-- #1 Solution 
-- #1 Compare every employee's salary with their collegues (include themslef) in same department
-- List the person (Employee2) whose salary is higher or eaqual than themself  
SELECT d.name AS Department, e1.name AS Employee1, e1.salary AS Salary1, e2.name AS Employee2, e2.salary AS Salary2
FROM Department AS d LEFT JOIN Employee AS e1
ON d.id = e1.departmentId LEFT JOIN Employee AS e2
ON e1.departmentId = e2.departmentId
WHERE e1.salary <= e2.salary
ORDER BY d.name, e1.name;

-- #2 List how many people get more (include themself) pay than themself
SELECT d.name AS Department, e1.name AS Employee1, e1.salary AS Salary1, COUNT(DISTINCT e2.salary) AS Higher_Salary
FROM Department AS d LEFT JOIN Employee AS e1
ON d.id = e1.departmentId LEFT JOIN Employee AS e2
ON e1.departmentId = e2.departmentId
WHERE e1.salary <= e2.salary
GROUP BY d.name, e1.name, e1.salary
ORDER BY d.name, e1.name;

-- #3 List the people who earn the top three salaries
SELECT d.name AS Department, e1.name AS Employee, e1.salary AS Salary
FROM Department AS d LEFT JOIN Employee AS e1
ON d.id = e1.departmentId LEFT JOIN Employee AS e2
ON e1.departmentId = e2.departmentId
WHERE e1.salary <= e2.salary
GROUP BY d.name, e1.name, e1.salary
HAVING COUNT(DISTINCT e2.salary) <= 3
ORDER BY d.name, e1.salary DESC;

-- #2 Solution 
SELECT x.Department, x.Employee, x.Salary
FROM (SELECT b.Name AS Department, a.Name AS Employee, a.Salary AS Salary, 
        DENSE_RANK() OVER (PARTITION BY b.Name ORDER BY a.Salary DESC) AS dept_rank
      FROM Employee AS a
      INNER JOIN Department AS b
      ON a.DepartmentId = b.Id) AS x
WHERE x.dept_rank <= 3;

## 196.[Easy] Delete Duplicate Emails

***Write an SQL query to delete all the duplicate emails, keeping only one unique email with the <br/> smallest id. Note that you are supposed to write a DELETE statement and not a SELECT one.***

Input:<br/> 
Person table:
| id |   email            |
|:--:|:------------------:|
| 1  | 'john@example.com' |
| 2  | 'bob@example.com'  |
| 3  | 'john@example.com' |

Output: 

| id |   email            |
|:--:|:------------------:|
| 1  | 'john@example.com' |
| 2  | 'bob@example.com'  |

Explanation: 'john@example.com' is repeated two times. We keep the row with the smallest Id = 1.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Person;
CREATE TABLE Person (Id int, Email varchar(255));
INSERT INTO Person (id, email) VALUES
	('1', 'john@example.com'),
	('2', 'bob@example.com'),
    ('3', 'john@example.com');

-- Writing your MySQL statement below
-- #1 From 2 tables
DELETE p1
FROM Person p1, Person p2
WHERE p1.email = p2.email AND p1.id > p2.id;

-- #2 Subquery
DELETE FROM Person 
WHERE id NOT IN (SELECT *
				 FROM (SELECT min(id)
					   FROM Person
					   GROUP BY email)AS temp);
SELECT * FROM Person;

## 197.[Easy] Rising Temperature

***Write an SQL query to find all dates' id with higher temperatures compared to its previous dates (yesterday).***

Weather table:
| id | recordDate | temperature |
|:--:|:----------:|:-----------:|
| 1  | 2015-01-01 | 10          |
| 2  | 2015-01-02 | 25          |
| 3  | 2015-01-03 | 20          |
| 4  | 2015-01-04 | 30          |

Output: 
| id |
|:--:|
| 2  |
| 4  |

Explanation:<br/>
In 2015-01-02, the temperature was higher than the previous day (10 -> 25).<br/>
In 2015-01-04, the temperature was higher than the previous day (20 -> 30).

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Weather;
CREATE TABLE Weather (id INT, recordDate DATE, temperature INT);
TRUNCATE TABLE Weather;
INSERT INTO Weather (id, recordDate, temperature) VALUES
    (1,'2015-01-01',10),   
	(2,'2015-01-02',25), 
	(3,'2015-01-03',20),   
	(4,'2015-01-04',30);

-- Write your MySQL query statement below
SELECT tod.id 
FROM Weather AS tod
LEFT JOIN Weather AS yes
-- today = yesterday + 1 day
ON tod.recordDate = ADDDATE(yes.recordDate, INTERVAL 1 DAY)
WHERE tod.temperature > yes.temperature;

## 262.[Hard] Trips and Users

***The cancellation rate is computed by dividing the number of canceled (by client or driver) requests with unbanned users by the total number of requests with unbanned users on that day.***

***Write a SQL query to find the cancellation rate of requests with unbanned users (both client and driver must not be banned) each day between "2013-10-01" and "2013-10-03". Round Cancellation Rate to two decimal points.***

Trips table:
| id | client_id | driver_id | city_id | status              | request_at |
|:--:|:---------:|:---------:|:-------:|:-------------------:|:----------:|
| 1  | 1         | 10        | 1       | completed           | 2013-10-01 |
| 2  | 2         | 11        | 1       | cancelled_by_driver | 2013-10-01 |
| 3  | 3         | 12        | 6       | completed           | 2013-10-01 |
| 4  | 4         | 13        | 6       | cancelled_by_client | 2013-10-01 |
| 5  | 1         | 10        | 1       | completed           | 2013-10-02 |
| 6  | 2         | 11        | 6       | completed           | 2013-10-02 |
| 7  | 3         | 12        | 6       | completed           | 2013-10-02 |
| 8  | 2         | 12        | 12      | completed           | 2013-10-03 |
| 9  | 3         | 10        | 12      | completed           | 2013-10-03 |
| 10 | 4         | 13        | 12      | cancelled_by_driver | 2013-10-03 |

Users table:
| users_id | banned | role   |
|:--------:|:------:|:------:|
| 1        | No     | client |
| 2        | Yes    | client |
| 3        | No     | client |
| 4        | No     | client |
| 10       | No     | driver |
| 11       | No     | driver |
| 12       | No     | driver |
| 13       | No     | driver |

Result table: 
| Day        | Cancellation Rate |
|:----------:|:-----------------:|
| 2013-10-01 | 0.33              |
| 2013-10-02 | 0.00              |
| 2013-10-03 | 0.50              |

Explanation:<br/> 
On 2013-10-01:
  - There were 4 requests in total, 2 of which were canceled.
  - However, the request with Id=2 was made by a banned client (User_Id=2), so it is ignored in the calculation.
  - Hence there are 3 unbanned requests in total, 1 of which was canceled.
  - The Cancellation Rate is (1 / 3) = 0.33

On 2013-10-02:
  - There were 3 requests in total, 0 of which were canceled.
  - The request with Id=6 was made by a banned client, so it is ignored.
  - Hence there are 2 unbanned requests in total, 0 of which were canceled.
  - The Cancellation Rate is (0 / 2) = 0.00
  
On 2013-10-03:
  - There were 3 requests in total, 1 of which was canceled.
  - The request with Id=8 was made by a banned client, so it is ignored.
  - Hence there are 2 unbanned request in total, 1 of which were canceled.
  - The Cancellation Rate is (1 / 2) = 0.50

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
 -- Creating SQL Schema
DROP TABLE IF EXISTS Trips;
CREATE TABLE Trips (`Id` INTEGER, `Client_Id` INTEGER, `Driver_Id` INTEGER, `City_Id` INTEGER, `Status` VARCHAR(19), `Request_at` DATETIME);
INSERT INTO Trips (`Id`, `Client_Id`, `Driver_Id`, `City_Id`, `Status`, `Request_at`) VALUES
	('1', '1', '10', '1', 'completed', '2013-10-01'),
	('2', '2', '11', '1', 'cancelled_by_driver', '2013-10-01'),
	('3', '3', '12', '6', 'completed', '2013-10-01'),
	('4', '4', '13', '6', 'cancelled_by_client', '2013-10-01'),
	('5', '1', '10', '1', 'completed', '2013-10-02'),
	('6', '2', '11', '6', 'completed', '2013-10-02'),
	('7', '3', '12', '6', 'completed', '2013-10-02'),
	('8', '2', '12', '12', 'completed', '2013-10-03'),
	('9', '3', '10', '12', 'completed', '2013-10-03'),
	('10', '4', '13', '12', 'cancelled_by_driver', '2013-10-03');

DROP TABLE IF EXISTS Users;
CREATE TABLE Users (`Users_Id` INTEGER, `Banned` VARCHAR(3), `Role` VARCHAR(6));
INSERT INTO Users (`Users_Id`, `Banned`, `Role`) VALUES
	('1', 'No', 'client'),
	('2', 'Yes', 'client'),
	('3', 'No', 'client'),
	('4', 'No', 'client'),
	('10', 'No', 'driver'),
	('11', 'No', 'driver'),
	('12', 'No', 'driver'),
	('13', 'No', 'driver');
	
-- Writing your MySQL query statement below
SELECT DATE_FORMAT(t.request_at, '%Y-%m-%d') AS Day, 
ROUND(SUM(CASE WHEN t.status != 'completed' THEN 1 ELSE 0 END)/COUNT(*), 2) AS "Cancellation Rate"
FROM Trips t INNER JOIN Users u1 
ON t.client_id = u1.users_id AND u1.banned = "No"
INNER JOIN Users u2
ON t.driver_id = u2.users_id AND u2.banned = "No"
WHERE t.request_at BETWEEN "2013-10-01" AND "2013-10-03"
GROUP BY t.request_at
ORDER BY Day;

## 511.[Easy] Game Play Analysis I

***Write an SQL query to report the first login date for each player.***

Activity table:
| player_id | device_id | event_date | games_played |
|:---------:|:---------:|:----------:|:------------:|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |

Result table: 
| player_id | first_login |
|:---------:|:-----------:|
| 1         | 2016-03-01  |
| 2         | 2017-06-25  |
| 3         | 2016-03-02  |

In [ ]:
-- Creating MySQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (player_id INT, device_id INT, event_date DATE, games_played INT);
INSERT INTO Activity (player_id, device_id, event_date, games_played) VALUES 
	('1', '2', '2016-03-01', '5'),
	('1', '2', '2016-05-02', '6'),
	('2', '3', '2017-06-25', '1'),
	('3', '1', '2016-03-02', '0'),
	('3', '4', '2018-07-03', '5');
    
-- Writing your MySQL query statement below
SELECT player_id, MIN(event_date) AS first_login
FROM Activity
GROUP BY player_id;

## 512.[Easy] Game Play Analysis II

***Write a SQL query that reports the device that is first logged in for each player.***

Activity table:
| player_id | device_id | event_date | games_played |
|:---------:|:---------:|:----------:|:------------:|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |

Result table:
| player_id | device_id |
|:---------:|:---------:|
| 1         | 2         |
| 2         | 3         |
| 3         | 1         |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (player_id INT, device_id INT, event_date DATE, games_played INT);
INSERT INTO Activity (player_id, device_id, event_date, games_played) VALUES 
	('1', '2', '2016-03-01', '5'),
	('1', '2', '2016-05-02', '6'),
	('2', '3', '2017-06-25', '1'),
	('3', '1', '2016-03-02', '0'),
	('3', '4', '2018-07-03', '5');
    
-- Writing your MySQL query statement below
SELECT player_id, device_id
FROM Activity 
WHERE (player_id, event_date)
IN (SELECT player_id, MIN(event_date) AS first_login
	FROM Activity
	GROUP BY player_id);

## 534.[Medium] Game Play Analysis III

***Write an SQL query that reports for each player and date, how many games played so far by the player.<br/>
That is, the total number of games played by the player until that date. Check the example for clarity.***

Input:<br/>
Activity table:
| player_id | device_id | event_date | games_played |
|:---------:|:---------:|:----------:|:------------:|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 1         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |

Output:
| player_id | event_date | games_played_so_far |
|:---------:|:----------:|:-------------------:|
| 1         | 2016-03-01 | 5                   |
| 1         | 2016-05-02 | 11                  |
| 1         | 2017-06-25 | 12                  |
| 3         | 2016-03-02 | 0                   |
| 3         | 2018-07-03 | 5                   |

For the player with id 1, 5 + 6 = 11 games played by 2016-05-02, and 5 + 6 + 1 = 12 games played by 2017-06-25.<br/>
For the player with id 3, 0 + 5 = 5 games played by 2018-07-03.

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (player_id INT, device_id INT, event_date date, games_played INT);
INSERT INTO Activity (player_id, device_id, event_date, games_played) VALUES
    (1, 2, "2016-03-01", 5),
    (1, 2, "2016-05-02", 6),
    (1, 3, "2017-06-25", 1),
    (3, 1, "2016-03-02", 0),
    (3, 4, "2018-07-03", 5);

-- Write your MySQL query statement below
SELECT player_id, event_date, 
SUM(games_played) OVER (PARTITION BY player_id ORDER BY event_date) AS games_played_so_far
FROM activity;

## 550.[Medium] Game Play Analysis IV

***Write an SQL query that reports the fraction of players that logged in again on the day after the day they first logged in,<br/>rounded to 2 decimal places.<br/>
In other words, you need to count the number of players that logged in for at least two consecutive days starting from their first<br/> login date, then divide that number by the total number of players.***

Input:<br/>
Activity table:
| player_id | device_id | event_date | games_played |
|:---------:|:---------:|:----------:|:------------:|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |

Output:
| fraction  |
|:---------:|
| 0.33      |

Only the player with id 1 logged back in after the first day he had logged in so the answer is 1/3 = 0.33

In [ ]:
-- Active: 1658960739017@@127.0.0.1@3306@LeetCode
-- Creating SQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (player_id INT, device_id INT, event_date date, ames_played INT);
INSERT INTO Activity (player_id, device_id, event_date, ames_played) VALUES
    (1, 2, "2016-03-01", 5),
    (1, 2, "2016-03-02", 6),
    (2, 3, "2017-06-25", 1),
    (3, 1, "2016-03-02", 0),
    (3, 4, "2018-07-03", 5);
    
-- Write your MySQL query statement below
-- #1 List first login dates for each player
SELECT player_id, MIN(event_date) AS first_login_date
FROM Activity 
GROUP BY player_id;

-- #2 table a: first login, table b: all information
-- a.first_login_date + 1 = b.event_date means login next day
SELECT ROUND(COUNT(DISTINCT b.player_id) / COUNT(DISTINCT a.player_id),2) AS fraction 
FROM (SELECT player_id, MIN(event_date) AS first_login_date
      FROM Activity 
      GROUP BY player_id) AS a LEFT JOIN Activity AS b 
ON a.player_id = b.player_id 
AND DATE_ADD(a. first_login_date, INTERVAL 1 DAY) = b.event_date;

## 569.[Hard] Median Employee Salary

***Write a SQL query to find the median salary of each company.<br/> 
Bonus points if you can solve it without using any built-in SQL functions.***

Input:<br/>
Employee Table:
|Id   | Company    | Salary |
|:---:|:----------:|:------:|
|1    | A          | 2341   |
|2    | A          | 341    |
|3    | A          | 15     |
|4    | A          | 15314  |
|5    | A          | 451    |
|6    | A          | 513    |
|7    | B          | 15     |
|8    | B          | 13     |
|9    | B          | 1154   |
|10   | B          | 1345   |
|11   | B          | 1221   |
|12   | B          | 234    |
|13   | C          | 2345   |
|14   | C          | 2645   |
|15   | C          | 2645   |
|16   | C          | 2652   |
|17   | C          | 65     |

Output:
|Id   | Company    | Salary |
|:---:|:----------:|:------:|
|5    | A          | 451    |
|6    | A          | 513    |
|12   | B          | 234    |
|9    | B          | 1154   |
|14   | C          | 2645   |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE  Employee (Id INT, Company VARCHAR(100), Salary INT);
INSERT INTO Employee (Id, Company, Salary) VALUES
	('1','A','2341'),
	('2','A','341'),
	('3','A','15'),
	('4','A','15314'),
	('5','A','451'),
	('6','A','513'),
	('7','B','15'),
	('8','B','13'),
	('9','B','1154'),
	('10','B','1345'),
	('11','B','1221'),
	('12','B','234'),
	('13','C','2345'),
	('14','C','2645'),
	('15','C','2645'),
	('16','C','2652'),
	('17','C','65');

-- Write your MySQL query statement below
SELECT Id, Company, Salary FROM
(SELECT *,
	   ROW_NUMBER() OVER(PARTITION BY company ORDER BY Salary) AS rank_num,
	   COUNT(*) OVER(PARTITION BY company) AS total_num 
FROM Employee) AS temp
WHERE (total_num % 2 = 0 AND rank_num = total_num/2)
   OR (total_num % 2 = 0 AND rank_num = total_num/2 + 1)
   OR (total_num % 2 = 1 AND rank_num = (total_num + 1)/2);

-- Bonus Solution
SELECT t1.Id AS Id, t1.Company, t1.Salary 
FROM Employee AS t1 JOIN Employee AS t2 
ON t1.Company = t2.Company
GROUP BY t1.Id, t1.Company, t1.Salary 
HAVING abs(SUM(CASE WHEN t2.Salary<t1.Salary THEN 1 
					WHEN t2.Salary>t1.Salary THEN -1
					WHEN t2.Salary=t1.Salary AND t2.Id<t1.Id THEN 1 
                    WHEN t2.Salary=t1.Salary AND t2.Id>t1.Id THEN -1 
                    ELSE 0 
			   END)) <= 1
ORDER BY t1.Company, t1.Salary, t1.Id;

## 570.[Medium] Managers with at Least 5 Direct Reports

***Write a SQL query that finds out managers with at least 5 direct report.***

Employee table:
|Id    |Name 	  |Department |ManagerId |
|:----:|:--------:|:---------:|:--------:|
|101   |John 	  |A 	      |null      |
|102   |Dan 	  |A 	      |101       |
|103   |James 	  |A 	      |101       |
|104   |Amy 	  |A 	      |101       |
|105   |Anne 	  |A 	      |101       |
|106   |Ron 	  |B 	      |101       |

Result table:
| Name  |
|:-----:|
| John  |

Note:
No one would report to himself.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (`Id` INTEGER, `Name` VARCHAR(5), `Department` VARCHAR(1), `ManagerId` VARCHAR(4));
INSERT INTO Employee (`Id`, `Name`, `Department`, `ManagerId`) VALUES
	('101', 'John', 'A', 'null'),
	('102', 'Dan', 'A', '101'),
	('103', 'James', 'A', '101'),
	('104', 'Amy', 'A', '101'),
	('105', 'Anne', 'A', '101'),
	('106', 'Ron', 'B', '101');

-- Writing your MySQL query statement below
-- Check
SELECT e1.*, e2.* 
FROM employee e1 INNER JOIN employee e2
ON e1.Id = e2.ManagerId;

-- Final
SELECT e1.name
FROM employee e1 INNER JOIN employee e2
ON e1.Id = e2.ManagerId
GROUP BY e1.name
HAVING COUNT(e2.id) >= 5;

## 571.[Hard] Find Median Given Frequency of Numbers

***Write a query to find the median of all numbers and name the result as median.***

Numbers table:
|  Number  |  Frequency  |
|:--------:|:-----------:|
|  0       |  7          |
|  1       |  1          |
|  2       |  3          |
|  3       |  1          |

In this table, the numbers are 0, 0, 0, 0, 0, 0, 0, 1, 2, 2, 2, 3, so the median is (0 + 0) / 2 = 0.

Result table:
| median |
|:------:|
| 0.0000 |

In [2]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Numbers;
CREATE TABLE Numbers (`Number` INTEGER, `Frequency` INTEGER);
INSERT INTO Numbers (`Number`, `Frequency`) VALUES
	('0', '7'),
	('1', '1'),
	('2', '3'),
	('3', '1');

-- Writing your MySQL query statement below
SELECT ROUND(SUM(number)/COUNT(number), 2) AS median
FROM (SELECT number, frequency,
             SUM(frequency) OVER (ORDER BY number) AS cumulative_num,
             SUM(frequency) OVER () AS total_num
             FROM numbers) AS temp
WHERE total_num/2.0 BETWEEN cumulative_num - frequency AND cumulative_num;

SyntaxError: invalid syntax (4282713654.py, line 1)

## 574.[Medium] Winning Candidate

***Write a sql to find the name of the winning candidate.***

Candidate table:
| id  | Name    |
|:---:|:-------:|
| 1   | A       |
| 2   | B       |
| 3   | C       |
| 4   | D       |
| 5   | E       |

Vote table:
| id  | CandidateId  |
|:---:|:------------:|
| 1   |     2        |
| 2   |     4        |
| 3   |     3        |
| 4   |     2        |
| 5   |     5        |

Reuslt table:
| Name |
|:----:|
| B    |

Notes:
You may assume there is no tie, in other words there will be only one winning candidate.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Candidate;
CREATE TABLE Candidate (`id` INTEGER, `Name` VARCHAR(1));
INSERT INTO Candidate (`id`, `Name`) VALUES
	('1', 'A'),
	('2', 'B'),
	('3', 'C'),
	('4', 'D'),
	('5', 'E');
  
DROP TABLE IF EXISTS Vote;
CREATE TABLE Vote (`id` INTEGER, `CandidateId` INTEGER);
INSERT INTO Vote (`id`, `CandidateId`) VALUES
	('1', '2'),
	('2', '4'),
	('3', '3'),
	('4', '2'),
	('5', '5');
    
-- Writing your MySQL query statement below
-- #1
SELECT name 
FROM Candidate 
WHERE id = (SELECT CandidateId
			FROM Vote
			GROUP BY CandidateId
			ORDER BY COUNT(CandidateId) DESC
			LIMIT 1);

-- #2
SELECT name 
FROM Candidate AS c 
INNER JOIN (SELECT CandidateId
			FROM Vote
			GROUP BY CandidateId
			ORDER BY COUNT(CandidateId) DESC
			LIMIT 1) AS t
ON c.Id = t.CandidateId;

## 577.[Easy] Employee Bonus

Select all employee's name and bonus whose bonus is < 1000.

Employee table:
| empId |  name  | supervisor| salary |
|:-----:|:------:|:---------:|:------:|
|   1   | John   |  3        | 1000   |
|   2   | Dan    |  3        | 2000   |
|   3   | Brad   |  null     | 4000   |
|   4   | Thomas |  3        | 4000   |

Bonus table:
| empId | bonus |
|:-----:|:-----:|
| 2     | 500   |
| 4     | 2000  |

Result table:
| name  | bonus |
|:-----:|:-----:|
| John  | null  |
| Dan   | 500   |
| Brad  | null  |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (`empId` INTEGER, `name` VARCHAR(6), `supervisor` VARCHAR(4), `salary` INTEGER);
INSERT INTO Employee (`empId`, `name`, `supervisor`, `salary`) VALUES
	('1', 'John', '3', '1000'),
	('2', 'Dan', '3', '2000'),
	('3', 'Brad', 'null', '4000'),
	('4', 'Thomas', '3', '4000');

DROP TABLE IF EXISTS Bonus;
CREATE TABLE Bonus (`empId` INTEGER, `bonus` INTEGER);
INSERT INTO Bonus (`empId`, `bonus`)VALUES
	('2', '500'),
	('4', '2000');
  
-- Writing your MySQL query statement below
SELECT e.name, b.bonus
FROM employee e LEFT JOIN bonus b
ON e.empId = b.empId
WHERE b.bonus < 1000 OR bonus IS NULL;

## 579.[Hard] Find Cumulative Salary of an Employee

***Write a SQL to get the cumulative sum of an employees salary over a period of 3 months but exclude the most recent month.***
- ***The result should be displayed by Id ascending, and then by Month descending.***

Employee table:
| Id | Month | Salary |
|:--:|:-----:|:------:|
| 1  | 1     | 20     |
| 2  | 1     | 20     |
| 1  | 2     | 30     |
| 2  | 2     | 30     |
| 3  | 2     | 40     |
| 1  | 3     | 40     |
| 3  | 3     | 60     |
| 1  | 4     | 60     |
| 3  | 4     | 70     |

Result table:
| Id | Month | Salary |
|:--:|:-----:|:------:|
| 1  | 3     | 90     |
| 1  | 2     | 50     |
| 1  | 1     | 20     |
| 2  | 1     | 20     |
| 3  | 3     | 100    |
| 3  | 2     | 40     |

Explanation:<br/>
Employee 1 has 3 salary records for the following 3 months except the most recent month 4: salary 40 for month 3, 30 for month 2 and 20 for month 1 So the cumulative sum of salary of this employee over 3 months is 90(40+30+20), 50(30+20) and 20 respectively.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (`Id` INTEGER, `Month` INTEGER, `Salary` INTEGER);
INSERT INTO Employee (`Id`, `Month`, `Salary`) VALUES
	('1', '1', '20'),
	('2', '1', '20'),
	('1', '2', '30'),
	('2', '2', '30'),
	('3', '2', '40'),
	('1', '3', '40'),
	('3', '3', '60'),
	('1', '4', '60'),
	('3', '4', '70');

-- Writing your MySQL query statement below
SELECT e1.Id, MAX(e2.month) AS Month, SUM(e2.salary) as Salary
FROM Employee e1 INNER JOIN Employee e2
ON e1.Id = e2.Id
WHERE e2.Month BETWEEN (e1.Month-3) AND (e1.Month-1)
GROUP BY e1.Id, e1.Month
ORDER BY Id, Month DESC;

## 578.[Medium] Get Highest Answer Rate Question

***Write a sql query to identify the question which has the highest answer rate.***

Input:<br/>
Survey_log table:
| id   | action    | question_id  | answer_id  | q_num     | timestamp  |
|:----:|:---------:|:------------:|:----------:|:---------:|:----------:|
| 5    | show      | 285          | null       | 1         | 123        |
| 5    | answer    | 285          | 124124     | 1         | 124        |
| 5    | show      | 369          | null       | 2         | 125        |
| 5    | skip      | 369          | null       | 2         | 126        |

Output:
| survey_log  |
|:-----------:|
|    285      |

Explanation:<br/>
question 285 has answer rate 1/1, while question 369 has 0/1 answer rate, so output 285.<br/>
Note: The highest answer rate meaning is: answer numbers ratio in show number in the same question.

In [ ]:
-- Create SQL Schema
DROP TABLE IF EXISTS Survey_log;
CREATE TABLE Survey_log (
  `uid` INTEGER,
  `action` VARCHAR(6),
  `question_id` INTEGER,
  `answer_id` VARCHAR(6),
  `q_num` INTEGER,
  `timestamp` INTEGER
);

INSERT INTO Survey_log (`uid`, `action`, `question_id`, `answer_id`, `q_num`, `timestamp`) VALUES
    ('5', 'show', '285', 'null', '1', '123'),
	('5', 'answer', '285', '124124', '1', '124'),
	('5', 'show', '369', 'null', '2', '125'),
	('5', 'skip', '369', 'null', '2', '126');

-- Write your MySQL query statement below
-- #1
SELECT question_id AS survey_log 
FROM (SELECT question_id,
	  SUM(CASE WHEN action='show' THEN 1 ELSE 0 END) AS nb_show,
	  SUM(CASE WHEN action='answer' THEN 1 ELSE 0 END) AS nb_answer 
   -- SUM(IF(action='show', 1, 0)) AS nb_show,
   -- SUM(IF(action='answer', 1, 0)) AS nb_answer 
	  FROM survey_log
	  GROUP BY question_id) AS temp
ORDER BY nb_answer/nb_show DESC -- 2 Qs have same ratio
LIMIT 1;

-- #2
WITH base AS (SELECT *, nb_answer/nb_show AS answer_rate
              FROM (SELECT question_id,
                    SUM(CASE WHEN action = "show" THEN 1 ELSE 0 END) AS nb_show,
                    SUM(CASE WHEN action = "answer" THEN 1 ELSE 0 END) AS nb_answer
                    FROM survey_log
                    GROUP BY question_id) as tmp)
SELECT question_id
FROM base
WHERE answer_rate IN (SELECT MAX(answer_rate) 
                      FROM base);

-- #3
WITH base AS (SELECT question_id, answer_rate, DENSE_RANK() OVER(ORDER BY answer_rate DESC) AS answer_rank
			  FROM (SELECT question_id,
			  ROUND(SUM(CASE WHEN action = "answer" THEN 1 ELSE 0 END)/
		      SUM(CASE WHEN action = "show" THEN 1 ELSE 0 END), 0) AS answer_rate
			  FROM survey_log
			  GROUP BY question_id) as temp)
SELECT question_id
FROM base
WHERE answer_rank = 1;

## 580.[Medium] Count Student Number in Departments

***Write a query to print the respective department name and number of students majoring in each department for all departments in the department table (even ones with no current students).***

***Sort your results by descending number of students; if two or more departments have the same number of students, then sort those departments alphabetically by department name.***

Student table:
| student_id | student_name | gender | dept_id |
|:----------:|:------------:|:------:|:-------:|
| 1          | Jack         | M      | 1       |
| 2          | Jane         | F      | 1       |
| 3          | Mark         | M      | 2       |

Department table:
| dept_id | dept_name   |
|:-------:|:-----------:|
| 1       | Engineering |
| 2       | Science     |
| 3       | Law         |

Result table
| dept_name   | student_number |
|:-----------:|:--------------:|
| Engineering | 2              |
| Science     | 1              |
| Law         | 0              |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS student;
CREATE TABLE student (`student_id` INTEGER, `student_name` VARCHAR(4), `gender` VARCHAR(1), `dept_id` INTEGER);
INSERT INTO student (`student_id`, `student_name`, `gender`, `dept_id`) VALUES
	('1', 'Jack', 'M', '1'),
	('2', 'Jane', 'F', '1'),
	('3', 'Mark', 'M', '2');

DROP TABLE IF EXISTS department;
CREATE TABLE department (`dept_id` INTEGER, `dept_name` VARCHAR(11));

INSERT INTO department (`dept_id`, `dept_name`) VALUES
	('1', 'Engineering'),
	('2', 'Science'),
	('3', 'Law');
    
-- Writing your MySQL query statement below
SELECT d.dept_name, IFNULL(COUNT(s.student_id), 0) AS student_number
FROM department d LEFT JOIN student s
ON d.dept_id = s.dept_id
GROUP BY d.dept_name
ORDER BY student_number DESC, d.dept_name;

## 584.[Easy] Find Customer Referee

***Write a query to return the list of customers NOT referred by the person with id '2'.***

Customer table:
| id   | name | referee_id|
|:----:|:----:|:---------:|
|    1 | Will |      NULL |
|    2 | Jane |      NULL |
|    3 | Alex |         2 |
|    4 | Bill |      NULL |
|    5 | Zack |         1 |
|    6 | Mark |         2 |

Result table:
| name |
|:----:|
| Will |
| Jane |
| Bill |
| Zack |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS customer;
CREATE TABLE customer(`id` INTEGER, `name` VARCHAR(4), `referee_id` VARCHAR(4));
INSERT INTO customer(`id`, `name`, `referee_id`)VALUES
	('1', 'Will', 'NULL'),
	('2', 'Jane', 'NULL'),
	('3', 'Alex', '2'),
	('4', 'Bill', 'NULL'),
	('5', 'Zack', '1'),
	('6', 'Mark', '2');
  
-- Writing your MySQL query statement below
SELECT name 
FROM customer 
WHERE referee_id != 2 OR referee_id IS NULL;

## 585.[Medium] Investments in 2016

***Write a query to print the sum of all total investment values in 2016 (TIV_2016), to a scale of <br/> 2 decimal places, for all policy holders who meet the following criteria:***
- ***Have the same TIV_2015 value as one or more other policyholders.***
- ***Are not located in the same city as any other policyholder (i.e.: the (latitude, longitude) attribute pairs must be unique).***

Input:<br/>
insurance table:
| PID | TIV_2015 | TIV_2016 | LAT | LON |
|:---:|:--------:|:--------:|:---:|:---:|
| 1   | 10       | 5        | 10  | 10  |
| 2   | 20       | 20       | 20  | 20  |
| 3   | 10       | 30       | 20  | 20  |
| 4   | 10       | 40       | 40  | 40  |


Output:
| TIV_2016 |
|:--------:|
| 45.00    |

In [ ]:
-- Creat SQL Schema
DROP TABLE IF EXISTS Insurance;
CREATE TABLE insurance (
  `PID` INTEGER,
  `TIV_2015` INTEGER,
  `TIV_2016` INTEGER,
  `LAT` INTEGER,
  `LON` INTEGER);

INSERT INTO insurance (`PID`, `TIV_2015`, `TIV_2016`, `LAT`, `LON`) VALUES
    ('1', '10', '5', '10', '10'),
    ('2', '20', '20', '20', '20'),
    ('3', '10', '30', '20', '20'),
    ('4', '10', '40', '40', '40');

-- Write your MySQL query statement beloww
SELECT CAST(SUM(TIV_2016) AS DECIMAL(4,2)) AS TIV_2016
FROM Insurance
WHERE TIV_2015 IN (SELECT TIV_2015
				           FROM Insurance
                   GROUP BY TIV_2015
                   HAVING COUNT(*) > 1)
AND (LAT, LON) IN (SELECT LAT, LON
				           FROM Insurance
				           GROUP BY LAT, LON
				           Having COUNT(*) = 1);

## 586.[Easy] Customer Placing the Largest Number of Orders

***Write an SQL query to find the customer_number for the customer who has placed the largest number of orders.***

***The test cases are generated so that exactly one customer will have placed more orders than any other customer.***

Orders table:
| order_number | customer_number |
|:------------:|:---------------:|
| 1            | 1               |
| 2            | 2               |
| 3            | 3               |
| 4            | 3               |

Result table: 
| customer_number |
|:---------------:|
| 3               |

Explanation: 
The customer with number 3 has two orders, which is greater than either customer 1 or 2 because each of them only has one order. 
So the result is customer_number 3.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS orders;
CREATE TABLE orders (`order_number` INTEGER, `customer_number` INTEGER, `order_date` DATETIME, `required_date` DATETIME,
					 `shipped_date` DATETIME, `status` VARCHAR(6), `comment` CHAR(1));
INSERT INTO orders (`order_number`, `customer_number`, `order_date`, `required_date`, `shipped_date`, `status`, `comment`) VALUES
	('1', '1', '2017-04-09', '2017-04-13', '2017-04-12', 'Closed', ''),
	('2', '2', '2017-04-15', '2017-04-20', '2017-04-18', 'Closed', ''),
	('3', '3', '2017-04-16', '2017-04-25', '2017-04-20', 'Closed', ''),
	('4', '3', '2017-04-18', '2017-04-28', '2017-04-25', 'Closed', '');
    
-- Writing your MySQL query statement below
SELECT customer_number 
FROM orders
GROUP BY customer_number
ORDER BY COUNT(order_number) DESC
LIMIT 1;

## 595.[Easy] Big Countries

***A country is big if:***
- ***it has an area of at least three million (i.e., 3000000 km2), or***
- ***it has a population of at least twenty-five million (i.e., 25000000).***

***Write an SQL query to report the name, population, and area of the big countries.***

World table:
| name        | continent | area    | population | gdp          |
|:-----------:|:---------:|:-------:|:----------:|:------------:|
| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
| Albania     | Europe    | 28748   | 2831741    | 12960000000  |
| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
| Andorra     | Europe    | 468     | 78115      | 3712000000   |
| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |

Result table: 
| name        | population | area    |
|:-----------:|:----------:|:-------:|
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS World;
CREATE TABLE World (`name` VARCHAR(11), `continent` VARCHAR(6), `area` INTEGER, `population` INTEGER, `gdp` INTEGER);
INSERT INTO World (`name`, `continent`, `area`, `population`, `gdp`) VALUES
	('Afghanistan', 'Asia', '652230', '25500100', '20343000'),
	('Albania', 'Europe', '28748', '2831741', '12960000'),
	('Algeria', 'Africa', '2381741', '37100000', '188681000'),
	('Andorra', 'Europe', '468', '78115', '3712000'),
	('Angola', 'Africa', '1246700', '20609294', '100990000');
  
-- Writing your MySQL query statement below
SELECT name, population, area
FROM World
WHERE population >= 25000000 OR area >= 3000000;

## 596.[Easy] Classes More Than 5 Students

***Write an SQL query to report all the classes that have at least five students.***

Courses table:
| student | class    |
|:-------:|:--------:|
| A       | Math     |
| B       | English  |
| C       | Math     |
| D       | Biology  |
| E       | Math     |
| F       | Computer |
| G       | Math     |
| H       | Math     |
| I       | Math     |

Result table: 
| class   |
|:-------:|
| Math    |

Explanation: 
- Math has 6 students, so we include it.
- English has 1 student, so we do not include it.
- Biology has 1 student, so we do not include it.
- Computer has 1 student, so we do not include it.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS courses;
CREATE TABLE courses (`student` VARCHAR(1), `class` VARCHAR(8));
INSERT INTO courses (`student`, `class`) VALUES
	('A', 'Math'),
	('B', 'English'),
	('C', 'Math'),
	('D', 'Biology'),
	('E', 'Math'),
	('F', 'Computer'),
	('G', 'Math'),
	('H', 'Math'),
	('I', 'Math');
  
-- Writing your MySQL query statement below
SELECT class
FROM courses
GROUP BY class
HAVING COUNT(class) >= 5;

## 597.[Easy] Friend Requests I: Overall Acceptance Rate

***Write a query to find the overall acceptance rate of requests rounded to 2 decimals, <br/>  which is the number of acceptance divide the number of requests.***

friend_request table:
| sender_id | send_to_id |request_date|
|:---------:|:----------:|:----------:|
| 1         | 2          | 2016_06-01 |
| 1         | 3          | 2016_06-01 |
| 1         | 4          | 2016_06-01 |
| 2         | 3          | 2016_06-02 |
| 3         | 4          | 2016-06-09 |

request_accepted table:
| requester_id | accepter_id |accept_date |
|:------------:|:-----------:|:----------:|
| 1            | 2           | 2016_06-03 |
| 1            | 3           | 2016-06-08 |
| 2            | 3           | 2016-06-08 |
| 3            | 4           | 2016-06-09 |
| 3            | 4           | 2016-06-10 |

result table:
|accept_rate|
|:---------:|
|       0.80|

Note:
The accepted requests are not necessarily from the table friend_request. 
In this case, you just need to simply count the total accepted requests 
(no matter whether they are in the original requests), 
and divide it by the number of requests to get the acceptance rate.

It is possible that a sender sends multiple requests to the same receiver, 
and a request could be accepted more than once. 
In this case, the duplicated requests or acceptances are only counted once.
If there is no requests at all, you should return 0.00 as the accept_rate.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS friend_request;
CREATE TABLE friend_request (`sender_id` INTEGER, `send_to_id` INTEGER, `request_date` VARCHAR(10));
INSERT INTO friend_request (`sender_id`, `send_to_id`, `request_date`) VALUES
	('1', '2', '2016_06-01'),
	('1', '3', '2016_06-01'),
	('1', '4', '2016_06-01'),
	('2', '3', '2016_06-02'),
	('3', '4', '2016-06-09');

DROP TABLE IF EXISTS request_accepted;
CREATE TABLE request_accepted (`requester_id` INTEGER, `accepter_id` INTEGER, `accept_date` VARCHAR(10));
INSERT INTO request_accepted (`requester_id`, `accepter_id`, `accept_date`) VALUES
	('1', '2', '2016_06-03'),
	('1', '3', '2016-06-08'),
	('2', '3', '2016-06-08'),
	('3', '4', '2016-06-09'),
	('3', '4', '2016-06-10');
  
-- Writing your MySQL query statement below
SELECT ROUND(IFNULL(
(SELECT COUNT(DISTINCT requester_id, accepter_id)
FROM request_accepted)
/(SELECT COUNT(DISTINCT sender_id, send_to_id) 
FROM friend_request), 0), 2) AS accept_rate;

## 601.[Hard] Human Traffic of Stadium

***Write an SQL query to display the recORds with three OR mORe rows with cONsecutive id's, 
AND the number of people is greater than OR equal to 100 fOR each.***
- Return the result table ORdered by visit_date in AScending ORder.

Input: <br/>
Stadium table:
| id   | visit_date | people    |
|:----:|:----------:|:---------:|
| 1    | 2017-01-01 | 10        |
| 2    | 2017-01-02 | 109       |
| 3    | 2017-01-03 | 150       |
| 4    | 2017-01-04 | 99        |
| 5    | 2017-01-05 | 145       |
| 6    | 2017-01-06 | 1455      |
| 7    | 2017-01-07 | 199       |
| 8    | 2017-01-09 | 188       |

Output: 
| id   | visit_date | people    |
|:----:|:----------:|:---------:|
| 5    | 2017-01-05 | 145       |
| 6    | 2017-01-06 | 1455      |
| 7    | 2017-01-07 | 199       |
| 8    | 2017-01-09 | 188       |

Explanation: <br/>
The four rows with ids 5, 6, 7, AND 8 have cONsecutive ids AND each of them hAS >= 100 people attended. <br/>
Note that row 8 wAS included even though the visit_date wAS not the next day after row 7.<br/>
The rows with ids 2 AND 3 are not included because we need at leASt three cONsecutive

In [ ]:
-- Creating SQL Schema
create table stadium (id int, visit_date date null, people int);
insert into stadium (id, visit_date, people) values
	('1','2017-01-01','10'),
	('2','2017-01-02','109'),
	('3','2017-01-03','150'),
	('4','2017-01-04','99'),
	('5','2017-01-05','145'),
	('6','2017-01-06','1455'),
	('7','2017-01-07','199'),
	('8','2017-01-08','188');

-- Write your MySQL query statement below
-- #1
WITH temp AS(
SELECT a.visit_date AS date1,
b.visit_date AS date2,
c.visit_date AS date3
FROM stadium AS a
LEFT JOIN stadium AS b 
ON DATEDIFF(a.visit_date, b.visit_date) = -1
LEFT JOIN stadium AS c
ON DATEDIFF(b.visit_date, c.visit_date) = -1
WHERE a.people >= 100
AND b.people >= 100
AND c.people >= 100)

SELECT date1 AS total_date FROM temp
UNION
SELECT date2 AS total_date FROM temp
UNION
SELECT date3 AS total_date FROM temp;

-- #2
SELECT a.visit_date -- a
FROM stadium AS a
LEFT JOIN stadium AS b
    --  a is day 1, b is day 2, c is day 3
    ON datediff(a.visit_date,b.visit_date) = -1
LEFT JOIN stadium AS c
    ON datediff(b.visit_date,c.visit_date) = -1
WHERE a.people >= 100 AND b.people >= 100 AND c.people >= 100
UNION
SELECT b.visit_date -- b
FROM stadium AS a
LEFT JOIN stadium AS b
    --  a is day 1, b is day 2, c is day 3
    ON datediff(a.visit_date,b.visit_date) = -1
LEFT JOIN stadium AS c
    ON datediff(b.visit_date,c.visit_date) = -1
WHERE a.people >= 100 AND b.people >= 100 AND c.people >= 100
UNION
SELECT c.visit_date -- c
FROM stadium AS a
LEFT JOIN stadium AS b
    --  a is day 1, b is day 2, c is day 3
    ON datediff(a.visit_date,b.visit_date) = -1
LEFT JOIN stadium AS c
    ON datediff(b.visit_date,c.visit_date) = -1
WHERE a.people >= 100 AND b.people >= 100 AND c.people >= 100;

-- Eric's answer
-- #1
SELECT DISTINCT a.visit_date
FROM stadium AS a, stadium AS b, stadium AS c
WHERE (
    --  a is day 1, b is day 2, c is day 3
    (datediff(a.visit_date,b.visit_date) = -1 AND datediff(b.visit_date,c.visit_date) = -1)
    --  a is day 2, b is day 1, c is day 3
    OR (datediff(a.visit_date,b.visit_date) = 1 AND datediff(b.visit_date,c.visit_date) = -2)
    --  a is day 3, b is day 1, c is day 2
    OR (datediff(a.visit_date,b.visit_date) = 2 AND datediff(b.visit_date,c.visit_date) = -1)
) AND a.people >= 100 AND b.people >= 100 AND c.people >= 100
ORDER BY a.visit_date;

-- #2 why don't change selct a/b/c???
SELECT a.visit_date
FROM stadium AS a
LEFT JOIN stadium AS b
    --  a is day 1, b is day 2, c is day 3
    ON datediff(a.visit_date,b.visit_date) = -1
LEFT JOIN stadium AS c
    ON datediff(b.visit_date,c.visit_date) = -1
WHERE a.people >= 100 AND b.people >= 100 AND c.people >= 100
UNION
SELECT a.visit_date
FROM stadium AS a
LEFT JOIN stadium AS b
    --  a is day 2, b is day 1, c is day 3
    ON datediff(a.visit_date,b.visit_date) = 1
LEFT JOIN stadium AS c
    ON datediff(b.visit_date,c.visit_date) = -2
WHERE a.people >= 100 AND b.people >= 100 AND c.people >= 100
UNION
SELECT a.visit_date
FROM stadium AS a
LEFT JOIN stadium AS b
    --  a is day 3, b is day 1, c is day 2
    ON datediff(a.visit_date,b.visit_date) = 2
LEFT JOIN stadium AS c
    ON datediff(b.visit_date,c.visit_date) = -1
WHERE a.people >= 100 AND b.people >= 100 AND c.people >= 100;

## 602.[Medium] Friend Requests II: Who has the most friends

***Write a query to find the the people who has most friends and the most friends number under the following rules:***
- ***It is guaranteed there is only 1 people having the most friends.***
- ***The friend request could only been accepted once, which mean there is no multiple records 
  with the same requester_id and accepter_id value.***
  
Input:<br/>
request_accepted Table:
| requester_id | accepter_id | accept_date|
|:------------:|:-----------:|:----------:|
| 1            | 2           | 2016_06-03 |
| 1            | 3           | 2016-06-08 |
| 2            | 3           | 2016-06-08 |
| 3            | 4           | 2016-06-09 |

Output:
| id | num |
|:--:|:---:|
| 3  | 3   |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS request_accepted;
CREATE TABLE request_accepted (requester_id INT NOT NULL, accepter_id INT NULL, accept_date DATE NULL);
INSERT INTO request_accepted (requester_id, accepter_id, accept_date) VALUES
	('1','2','2016/06/03'),
	('1','3','2016/06/08'),
	('2','3','2016/06/08'),
	('3','4','2016/06/09');

-- Write your MySQL query statement below
SELECT id, COUNT(id) AS num
FROM (SELECT requester_id AS id FROM request_accepted
	  UNION ALL 
      SELECT accepter_id AS id FROM request_accepted) AS temp
GROUP BY id
ORDER BY COUNT(id) DESC
LIMIT 1;

## 603.[Easy] Consecutive Available Seats

***Several friends at a cinema ticket office would like to reserve consecutive available seats.***

***Can you help to query all the consecutive available seats order by the seat_id using the following cinema table?**

cinema table:
| seat_id | free |
|:-------:|:----:|
| 1       | 1    |
| 2       | 0    |
| 3       | 1    |
| 4       | 1    |
| 5       | 1    |

result table:
| seat_id |
|:-------:|
| 3       |
| 4       |
| 5       |

Note:
The seat_id is an auto increment int, and free is bool ('1' means free, and '0' means occupied.).
Consecutive available seats are more than 2(inclusive) seats consecutively available.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS cinema;
CREATE TABLE cinema (`seat_id` INTEGER, `free` INTEGER);
INSERT INTO cinema (`seat_id`, `free`)VALUES
	('1', '1'),
	('2', '0'),
	('3', '1'),
	('4', '1'),
	('5', '1');
    
-- Writing your MySQL query statement below
SELECT DISTINCT c1.seat_id
FROM cinema AS c1 INNER JOIN cinema AS c2
-- ABS() returns the absolute value of a number.
ON ABS(c1.seat_id - c2.seat_id) = 1
AND c1.free = 1 AND c2.free = 1
ORDER BY c1.seat_id;

## 607.[Easy] Sales Person

***Write an SQL query to report the names of all the salespersons who did not have any orders related to the company with the name "RED".***

SalesPerson table:
| sales_id | name | salary | commission_rate | hire_date  |
|:--------:|:----:|:------:|:---------------:|:----------:|
| 1        | John | 100000 | 6               | 4/1/2006   |
| 2        | Amy  | 12000  | 5               | 5/1/2010   |
| 3        | Mark | 65000  | 12              | 12/25/2008 |
| 4        | Pam  | 25000  | 25              | 1/1/2005   |
| 5        | Alex | 5000   | 10              | 2/3/2007   |

Company table:
| com_id | name   | city     |
|:------:|:------:|:--------:|
| 1      | RED    | Boston   |
| 2      | ORANGE | New York |
| 3      | YELLOW | Boston   |
| 4      | GREEN  | Austin   |

Orders table:
| order_id | order_date | com_id | sales_id | amount |
|:--------:|:----------:|:------:|:--------:|:------:|
| 1        | 1/1/2014   | 3      | 4        | 10000  |
| 2        | 2/1/2014   | 4      | 5        | 5000   |
| 3        | 3/1/2014   | 1      | 1        | 50000  |
| 4        | 4/1/2014   | 1      | 4        | 25000  |

Result table: 
| name |
|:----:|
| Amy  |
| Mark |
| Alex |

Explanation: 
According to orders 3 and 4 in the Orders table, it is easy to tell that only salesperson John and Pam have sales to company RED, 
so we report all the other names in the table salesperson.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS salesperson;
CREATE TABLE salesperson (`sales_id` INTEGER, `name` VARCHAR(4), `salary` INTEGER, `commission_rate` INTEGER, `hire_date` DATETIME);
INSERT INTO salesperson (`sales_id`, `name`, `salary`, `commission_rate`, `hire_date`) VALUES
	('1', 'John', '100000', '6', '2006-4-1'),
	('2', 'Amy', '120000', '5', '2010-5-1'),
	('3', 'Mark', '65000', '12', '2008-12-25'),
	('4', 'Pam', '25000', '25', '2005-1-1'),
	('5', 'Alex', '50000', '10', '2007-2-3');

DROP TABLE IF EXISTS company;
CREATE TABLE company (`com_id` INTEGER, `name` VARCHAR(6), `city` VARCHAR(8));
INSERT INTO company (`com_id`, `name`, `city`) VALUES
	('1', 'RED', 'Boston'),
	('2', 'ORANGE', 'New York'),
	('3', 'YELLOW', 'Boston'),
	('4', 'GREEN', 'Austin');
    
DROP TABLE IF EXISTS orders;
CREATE TABLE orders (`order_id` INTEGER, `order_date` DATETIME, `com_id` INTEGER, `sales_id` INTEGER, `amount` INTEGER);
INSERT INTO orders (`order_id`, `order_date`, `com_id`, `sales_id`, `amount`) VALUES
	('1', '2014-1-1', '3', '4', '100000'),
	('2', '2014-2-1', '4', '5', '5000'),
	('3', '2014-3-1', '1', '1', '50000'),
	('4', '2014-4-1', '1', '4', '25000');
    
-- Writing your MySQL query statement below
SELECT name
FROM salesperson
WHERE sales_id NOT IN(SELECT o.sales_id
					  FROM orders o LEFT JOIN company c 
					  ON o.com_id = c.com_id
					  WHERE c.name = "RED");

## 608.[Medium] Tree Node: print node id and type

***Write an SQL query to report the type of each node in the tree.***
- ***Return the result table ordered by id in ascending order.***
***Each node in the tree can be one of three types:***
- ***"Leaf": if the node is a leaf node.***
- ***"Root": if the node is the root of the tree.***
- ***"Inner": If the node is neither a leaf node nor a root node.***

<img src = https://assets.leetcode.com/uploads/2021/10/22/tree1.jpg>

Input: <br/>
Tree table:

| id | p_id |
|:--:|:----:|
| 1  | null |
| 2  | 1    |
| 3  | 1    |
| 4  | 2    |
| 5  | 2    |

Output: 
| id | type  |
|:--:|:-----:|
| 1  | Root  |
| 2  | Inner |
| 3  | Leaf  |
| 4  | Leaf  |
| 5  | Leaf  |

Explanation: <br/>
- Node 1 is the root node because its parent node is null and it has child nodes 2 and 3.
- Node 2 is an inner node because it has parent node 1 and child node 4 and 5.
- Nodes 3, 4, and 5 are leaf nodes because they have parent nodes and they do not have child nodes.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS tree;
CREATE TABLE tree (id INT, p_id int);
INSERT INTO tree VALUES 
	(1,NULL), 
    (2,1), 
    (3,1), 
    (4,2), 
    (5,2);

-- Write your MySQL query statement below
SELECT t1.id, t1.p_id, t2.id, t2.p_id
FROM tree AS t1 LEFT JOIN tree AS t2 
ON t1.id = t2.p_id;
/*
# id, p_id, id, p_id
'1', NULL, '3', '1'
'1', NULL, '2', '1'
'2', '1', '5', '2'
'2', '1', '4', '2'
'3', '1', NULL, NULL
'4', '2', NULL, NULL
'5', '2', NULL, NULL
*/

SELECT DISTINCT t1.id, 
	   CASE WHEN ISNULL(t1.p_id) THEN 'Root' 
            WHEN ISNULL(t2.id) THEN 'Leaf' 
            ELSE 'Inner'
	   END AS 'type'
FROM tree AS t1 LEFT JOIN tree AS t2 
ON t1.id = t2.p_id

## 610.[Easy] Triangle Judgement

***A pupil Tim gets homework to identify whether three line segments could possibly form a triangle.***

***Could you help Tim by writing a query to judge whether these three sides can form a triangle, assuming table triangle holds the length of the three sides x, y and z.***

Triangle table:
| x  | y  | z  |
|:--:|:--:|:--:|
| 13 | 15 | 30 |
| 10 | 20 | 15 |

Result table:
| x  | y  | z  | triangle |
|:--:|:--:|:--:|:--------:|
| 13 | 15 | 30 | No       |
| 10 | 20 | 15 | Yes      |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS triangle;
CREATE TABLE triangle (`x` INTEGER, `y` INTEGER, `z` INTEGER);
INSERT INTO triangle (`x`, `y`, `z`) VALUES
	('13', '15', '30'),
	('10', '20', '15');

-- Writing your MySQL query statement below
SELECT *, CASE WHEN x + y > z 
			 AND x + z > y
             AND y + z > x
			Then "Yes"
		    ELSE "No" END AS triangle
FROM triangle

## 612.[Medium] Shortest Distance in a Plane

***Write a query to find the shortest distance between these points rounded to 2 decimals.***

Point_2d table:
 | x  | y  |
 |:--:|:--:|
 | -1 | -1 |
 | 0  | 0  |
 | -1 | -2 |

Result table:
 | shortest |
 |:--------:|
 | 1.00     |
 
Note: 
The shortest distance is 1.00 from point (-1,-1) to (-1,-2). 
The longest distance among all the points are less than 10000.

***The distance between two points (x1, y1) and (x2, y2) on a plane can be calculated by pythagorean theorem.***
<img src = https://i0.wp.com/lifewithdata.com/wp-content/uploads/2021/08/leetcode87.png>

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS point_2d;
CREATE TABLE point_2d (`x` INTEGER, `y` INTEGER);
INSERT INTO point_2d (`x`, `y`) VALUES
	('-1', '-1'),
	('0', '0'),
	('-1', '-2');
    
-- Writing your MySQL query statement below
-- #1
SELECT ROUND(SQRT(MIN(POW(p1.x-p2.x,2) + POW(p1.y-p2.y,2))),2) shortest
FROM point_2d p1 
CROSS JOIN point_2d p2
WHERE NOT (p1.x = p2.x AND p1.y = p2.y);

-- #2
SELECT  ROUND(SQRT(MIN(POW(p1.x-p2.x,2) + POW(p1.y-p2.y,2))),2) shortest
FROM point_2d p1, point_2d p2
WHERE p1.x <> p2.x OR p1.y <> p2.y
-- https://lifewithdata.com/2021/08/06/sql-interview-questions-leetcode-612-shortest-distance-in-a-plane/

## 613.[Easy] Shortest Distance in a Line

***Write a query to find the shortest distance between two points in these points.***

Point table:
| x   |
|:---:|
| -1  |
| 0   |
| 2   |

Result table: 
| shortest|
|:-------:|
| 1       |

The shortest distance is '1' obviously, which is from point '-1' to '0'.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS point;
CREATE TABLE point (`x` INTEGER, `ignore` VARCHAR(1));
INSERT INTO point (`x`, `ignore`) VALUES
	('-1', '_'),
	('0', '_'),
	('2', '_');
    
-- Writing your MySQL query statement below
SELECT MIN(ABS(p1.x - p2.x)) AS shortest
FROM point p1 INNER JOIN point p2
ON p1.x != p2.x;

## 614.[Medium] Second Degree Follower

***Please write a sql query to get the amount of each followers follower if he/she has one.***
- ***Followee would not follow himself/herself in all cases.***
- ***Please display the result in followers alphabet order.***

Follow table:
| followee    | follower   |
|:-----------:|:----------:|
|     A       |     B      |
|     B       |     C      |
|     B       |     D      |
|     D       |     E      |

Result table:
| follower    | num        |
|:-----------:|:----------:|
|     B       |  2         |
|     D       |  1         |

Explaination:
Both B and D exist in the follower list, when as a followee, Bs follower is C and D, and Ds follower is E. 
A does not exist in follower list.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS follow;
CREATE TABLE follow (`followee` VARCHAR(1), `follower` VARCHAR(1));
INSERT INTO follow (`followee`, `follower`) VALUES
	('A', 'B'),
	('B', 'C'),
	('B', 'D'),
	('D', 'E');
    
-- Writing your MySQL query statement below
-- Check
SELECT f1.*, f2.*
FROM follow f1 LEFT JOIN follow f2
ON f1.follower = f2.followee;

-- Final
SELECT follower, num 
FROM (SELECT f1.follower AS follower, COUNT(DISTINCT f2.follower) AS num
	  FROM follow f1 LEFT JOIN follow f2
	  ON f1.follower = f2.followee
      GROUP BY f1.follower) AS temp
WHERE num > 0
ORDER BY follower;

## 615.[Hard] Average Salary: Departments VS Company

***write a query to display the comparison result (higher/lower/same) of the average salary of <br/> employees in a department to the companys average salary.***

Input:<br/>
Salary Table:
| id | employee_id | amount | pay_date   |
|:--:|:-----------:|:------:|:----------:|
| 1  | 1           | 9000   | 2017-03-31 |
| 2  | 2           | 6000   | 2017-03-31 |
| 3  | 3           | 10000  | 2017-03-31 |
| 4  | 1           | 7000   | 2017-02-28 |
| 5  | 2           | 6000   | 2017-02-28 |
| 6  | 3           | 8000   | 2017-02-28 |

Employee Table:
| employee_id | department_id |
|:-------------:|:---------------:|
| 1           | 1             |
| 2           | 2             |
| 3           | 2             |

Output:
| pay_month | department_id | comparison  |
|:---------:|:-------------:|:-----------:|
| 2017-03   | 1             | higher      |
| 2017-03   | 2             | lower       |
| 2017-02   | 1             | same        |
| 2017-02   | 2             | same        |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS salary;
CREATE TABLE salary (id int, employee_id INT, amount INT, pay_date DATE);
INSERT INTO salary (id, employee_id, amount, pay_date) VALUES
	('1','1','9000','2017/03/31'),
	('2','2','6000','2017/03/31'),
	('3','3','10000','2017/03/31'),
	('4','1','7000','2017/02/28'),
	('5','2','6000','2017/02/28'),
	('6','3','8000','2017/02/28');
DROP TABLE IF EXISTS employee;
CREATE TABLE employee (employee_id INT, department_id INT);
INSERT INTO employee (employee_id, department_id) VALUES
	('1','1'),
	('2','2'),
	('3','2');

-- Write your MySQL query statement below
SELECT LEFT(pay_date, 7) AS pay_month, department_id,
	   CASE WHEN department_avg > company_avg THEN 'higher'
	        WHEN department_avg < company_avg THEN 'lower'
			ELSE 'same' 
            END AS comparison
FROM(SELECT DISTINCT pay_date, department_id,
			AVG(amount) OVER(PARTITION BY pay_date) AS company_avg,
			AVG(amount) OVER(PARTITION BY pay_date, department_id) AS department_avg
			FROM salary AS s LEFT JOIN employee AS e
			ON s.employee_id = e. employee_id) AS temp
ORDER BY pay_month DESC;

## 618.[Hard] Students Report By Geography

***Pivot the continent column in this table so that each name is sorted alphabetically and displayed underneath its corresponding continent.***
- ***The output headers should be America, Asia and Europe respectively.***

| name   | continent |
|:------:|:---------:|
| Jack   | America   |
| Pascal | Europe    |
| Xi     | Asia      |
| Jane   | America   |


| America | Asia | Europe |
|:-------:|:----:|:------:|
| Jack    | Xi   | Pascal |
| Jane    |      |        |

Follow-up: If it is unknown which continent has the most students, can you write a query to generate the student report?

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS student;
CREATE TABLE student (`name` VARCHAR(6), `continent` VARCHAR(7));
INSERT INTO student (`name`, `continent`) VALUES
	('Jack', 'America'),
	('Pascal', 'Europe'),
	('Xi', 'Asia'),
	('Jane', 'America');
    
-- Writing your MySQL query statement below
SELECT America, Asia, Europe
FROM(SELECT row_num,
		    MAX(CASE WHEN continent = 'America' THEN name END )AS America,
			MAX(CASE WHEN continent = 'Europe' THEN name END )AS Europe,
			MAX(CASE WHEN continent = 'Asia' THEN name END )AS Asia
	 FROM (SELECT *,
				  ROW_NUMBER()OVER(PARTITION BY continent ORDER BY name) AS row_num
		   FROM student) AS SOURCE
GROUP BY row_num)temp;

## 619.[Easy] Biggest Single Number

***Table my_numbers contains many numbers in column num including duplicated ones.***

***Can you write a SQL query to find the biggest number, which only appears once?***

my_numbers table:
|num|
|:-:|
| 8 |
| 8 |
| 3 |
| 3 |
| 1 |
| 4 |
| 5 |
| 6 | 

result table:
|num|
|:-:|
| 6 |

Note:
If there is no such number, just output null

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS my_numbers;
CREATE TABLE my_numbers (`num` INTEGER, `ignore` VARCHAR(1));
INSERT INTO my_numbers (`num`, `ignore`) VALUES
	('8', '_'),
	('8', '_'),
	('3', '_'),
	('3', '_'),
	('1', '_'),
	('4', '_'),
	('5', '_'),
	('6', '_');
    
-- Writing your MySQL query statement below
SELECT MAX(num)
FROM (SELECT num
	  FROM my_numbers
	  GROUP BY num 
	  HAVING COUNT(num) = 1) AS temp;

## 620.[Easy] Not Boring Movies

***Write an SQL query to report the movies with an odd-numbered ID and a description that is not "boring".***
- ***Return the result table ordered by rating in descending order.***

Cinema table:
| id | movie      | description | rating |
|:--:|:----------:|:-----------:|:------:|
| 1  | War        | great 3D    | 8.9    |
| 2  | Science    | fiction     | 8.5    |
| 3  | irish      | boring      | 6.2    |
| 4  | Ice song   | Fantacy     | 8.6    |
| 5  | House card | Interesting | 9.1    |

Result table: 
| id | movie      | description | rating |
|:--:|:----------:|:-----------:|:------:|
| 5  | House card | Interesting | 9.1    |
| 1  | War        | great 3D    | 8.9    |

Explanation: 
We have three movies with odd-numbered IDs: 1, 3, and 5. The movie with ID = 3 is boring so we do not include it in the answer.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS cinema;
CREATE TABLE cinema (`id` INTEGER, `movie` VARCHAR(10), `description` VARCHAR(11), `rating` FLOAT);
INSERT INTO cinema (`id`, `movie`, `description`, `rating`) VALUES
	('1', 'War', 'great 3D', '8.9'),
	('2', 'Science', 'fiction', '8.5'),
	('3', 'irish', 'boring', '6.2'),
	('4', 'Ice song', 'Fantacy', '8.6'),
	('5', 'House card', 'Interesting', '9.1');
    
-- Writing your MySQL query statement below
SELECT id, movie, description, rating
FROM cinema
-- Check odd number 
WHERE MOD(id, 2) = 1 
AND description != "boring"
ORDER BY rating DESC;

## 626.[Medium] Exchange Seats

***Write an SQL query to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.**
- ***Return the result table ordered by id in ascending order.***

Seat table:
| id | student |
|:--:|:-------:|
| 1  | Abbot   |
| 2  | Doris   |
| 3  | Emerson |
| 4  | Green   |
| 5  | Jeames  |

Result table: 
| id | student |
|:--:|:-------:|
| 1  | Doris   |
| 2  | Abbot   |
| 3  | Green   |
| 4  | Emerson |
| 5  | Jeames  |

Explanation: 
Note that if the number of students is odd, there is no need to change the last one's seat.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS seat;
CREATE TABLE seat (`id` INTEGER, `student` VARCHAR(7));
INSERT INTO seat (`id`, `student`) VALUES
	('1', 'Abbot'),
	('2', 'Doris'),
	('3', 'Emerson'),
	('4', 'Green'),
	('5', 'Jeames');

-- Writing your MySQL query statement below
SELECT (CASE WHEN MOD(id, 2) = 0 THEN id - 1
			 WHEN id = (SELECT MAX(id) FROM seat) THEN id
			 ELSE id + 1
			 END) AS id, student
FROM seat
ORDER BY id;

## 627.[Easy] Swap Salary

***Write an SQL query to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.***
***Note that you must write a single update statement, do not write any select statement for this problem.***

Salary table:
| id | name | sex | salary |
|:--:|:----:|:---:|:------:|
| 1  | A    | m   | 2500   |
| 2  | B    | f   | 1500   |
| 3  | C    | m   | 5500   |
| 4  | D    | f   | 500    |

Result table: 
| id | name | sex | salary |
|:--:|:----:|:---:|:------:|
| 1  | A    | f   | 2500   |
| 2  | B    | m   | 1500   |
| 3  | C    | f   | 5500   |
| 4  | D    | m   | 500    |

Explanation: 
(1, A) and (3, C) were changed from 'm' to 'f'.
(2, B) and (4, D) were changed from 'f' to 'm'.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS salary;
CREATE TABLE salary (`id` INTEGER, `name` VARCHAR(1), `sex` VARCHAR(1), `salary` INTEGER);
INSERT INTO salary (`id`, `name`, `sex`, `salary`) VALUES
	('1', 'A', 'm', '2500'),
	('2', 'B', 'f', '1500'),
	('3', 'C', 'm', '5500'),
	('4', 'D', 'f', '500');
    
-- Writing your MySQL query statement below
UPDATE salary
SET sex = CASE sex
		  WHEN 'm' THEN 'f'
		  ELSE 'm'
		  END;

SELECT * FROM salary;

## 1045.[Medium] Customers Who Bought All Products

***Write an SQL query for a report that provides the customer ids from the Customer table that bought all the products in the Product table.***

Customer table:
| customer_id | product_key |
|:-----------:|:-----------:|
| 1           | 5           |
| 2           | 6           |
| 3           | 5           |
| 3           | 6           |
| 1           | 6           |

Product table:
| product_key |
|:-----------:|
| 5           |
| 6           |

Result table:
| customer_id |
|:-----------:|
| 1           |
| 3           |

The customers who bought all the products (5 and 6) are customers with id 1 and 3.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Customer;
CREATE TABLE Customer (
  `customer_id` INTEGER,
  `product_key` INTEGER);

INSERT INTO Customer (`customer_id`, `product_key`) VALUES
  ('1', '5'),
  ('2', '6'),
  ('3', '5'),
  ('3', '6'),
  ('1', '6');

DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_key` INTEGER,
  `ignore` VARCHAR(1));

INSERT INTO Product (`product_key`, `ignore`) VALUES
  ('5', '_'),
  ('6', '_');
  
-- Writing your MySQL query statement below
SELECT customer_id
FROM customer
GROUP BY customer_id
HAVING COUNT(DISTINCT product_key) = (SELECT COUNT(DISTINCT product_key) FROM Product);

## 1050.[Easy] Actors and Directors Who Cooperated At Least Three Times

***Write a SQL query for a report that provides the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.***

ActorDirector table:
| actor_id    | director_id | timestamp   |
|:-----------:|:-----------:|:-----------:|
| 1           | 1           | 0           |
| 1           | 1           | 1           |
| 1           | 1           | 2           |
| 1           | 2           | 3           |
| 1           | 2           | 4           |
| 2           | 1           | 5           |
| 2           | 1           | 6           |

Result table: 
| actor_id    | director_id |
|:-----------:|:-----------:|
| 1           | 1           |

Explanation: The only pair is (1, 1) where they cooperated exactly 3 times.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS ActorDirector;
CREATE TABLE ActorDirector (
  `actor_id` INTEGER,
  `director_id` INTEGER,
  `timestamp` INTEGER);

INSERT INTO ActorDirector (`actor_id`, `director_id`, `timestamp`) VALUES
  ('1', '1', '0'),
  ('1', '1', '1'),
  ('1', '1', '2'),
  ('1', '2', '3'),
  ('1', '2', '4'),
  ('2', '1', '5'),
  ('2', '1', '6');
  
-- Writing your MySQL query statement below
SELECT actor_id, director_id
FROM ActorDirector
GROUP BY actor_id, director_id
HAVING COUNT(director_id) >=3

## 1068.[Easy] Product Sales Analysis I

***Write an SQL query that reports all product names of the products in the Sales table along with their selling year and price.***

Sales table:
| sale_id | product_id | year | quantity | price |
|:-------:|:----------:|:----:|:--------:|:-----:|
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

Product table:
| product_id | product_name |
|:----------:|:------------:|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

Result table:
| product_name | year  | price |
|:------------:|:-----:|:-----:|
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Sales;
CREATE TABLE Sales (
  `sale_id` INTEGER,
  `product_id` INTEGER,
  `year` INTEGER,
  `quantity` INTEGER,
  `price` INTEGER);

INSERT INTO Sales (`sale_id`, `product_id`, `year`, `quantity`, `price`) VALUES
  ('1', '100', '2008', '10', '5000'),
  ('2', '100', '2009', '12', '5000'),
  ('7', '200', '2011', '15', '9000');

DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_id` INTEGER,
  `product_name` VARCHAR(7));

INSERT INTO Product (`product_id`, `product_name`) VALUES
  ('100', 'Nokia'),
  ('200', 'Apple'),
  ('300', 'Samsung');

-- Writing your MySQL query statement below
SELECT p.product_name, s.year, s.price
FROM Sales s LEFT JOIN Product p
ON s.product_id = p.product_id

## 1069.[Easy] Product Sales Analysis II

***Write an SQL query that reports the total quantity sold for every product id.***

Sales table:
| sale_id | product_id | year | quantity | price |
|:-------:|:----------:|:----:|:--------:|:-----:|
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

Product table:
| product_id | product_name |
|:----------:|:------------:|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

Result table:
| product_id   | total_quantity |
|:------------:|:--------------:|
| 100          | 22             |
| 200          | 15             |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Sales;
CREATE TABLE Sales (
`sale_id` INTEGER,
  `product_id` INTEGER,
  `year` INTEGER,
  `quantity` INTEGER,
  `price` INTEGER);

INSERT INTO Sales (`sale_id`, `product_id`, `year`, `quantity`, `price`) VALUES
  ('1', '100', '2008', '10', '5000'),
  ('2', '100', '2009', '12', '5000'),
  ('7', '200', '2011', '15', '9000');

DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_id` INTEGER,
  `product_name` VARCHAR(7));

INSERT INTO Product (`product_id`, `product_name`) VALUES
  ('100', 'Nokia'),
  ('200', 'Apple'),
  ('300', 'Samsung');
  
-- Writing your MySQL query statement below
SELECT  product_id, SUM(quantity) AS total_quantity
FROM Sales
GROUP BY product_id

## 1070.[Medium] Product Sales Analysis III

***Write an SQL query that selects the product id, year, quantity, and price for the first year of every product sold.***

Sales table:
| sale_id | product_id | year | quantity | price |
|:-------:|:----------:|:----:|:--------:|:-----:|
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

Product table:
| product_id | product_name |
|:----------:|:------------:|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

Result table:
| product_id | first_year | quantity | price |
|:----------:|:----------:|:--------:|:-----:|
| 100        | 2008       | 10       | 5000  |
| 200        | 2011       | 15       | 9000  |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Sales;
CREATE TABLE Sales (
  `sale_id` INTEGER,
  `product_id` INTEGER,
  `year` INTEGER,
  `quantity` INTEGER,
  `price` INTEGER);

INSERT INTO Sales (`sale_id`, `product_id`, `year`, `quantity`, `price`) VALUES
  ('1', '100', '2008', '10', '5000'),
  ('2', '100', '2009', '12', '5000'),
  ('7', '200', '2011', '15', '9000');

DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_id` INTEGER,
  `product_name` VARCHAR(7));

INSERT INTO Product (`product_id`, `product_name`) VALUES
  ('100', 'Nokia'),
  ('200', 'Apple'),
  ('300', 'Samsung');

-- Writing your MySQL query statement below
SELECT product_id, year AS first_year, quantity, price
FROM (SELECT product_id, year, quantity, price, ROW_NUMBER() OVER (PARTITION BY product_id ORDER BY year ASC) AS yr
	  FROM Sales) t
WHERE yr = 1;

## 1075.[Easy] Project Employees I

***Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.***

Project table:
| project_id  | employee_id |
|:-----------:|:-----------:|
| 1           | 1           |
| 1           | 2           |
| 1           | 3           |
| 2           | 1           |
| 2           | 4           |

Employee table:
| employee_id | name   | experience_years |
|:-----------:|:------:|:----------------:|
| 1           | Khaled | 3                |
| 2           | Ali    | 2                |
| 3           | John   | 1                |
| 4           | Doe    | 2                |

Result table:
| project_id  | average_years |
|:-----------:|:-------------:|
| 1           | 2.00          |
| 2           | 2.50          |

The average experience years for the first project is (3 + 2 + 1) / 3 = 2.00 and for the second project is (3 + 2) / 2 = 2.50

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Project;
CREATE TABLE Project (
  `project_id` INTEGER,
  `employee_id` INTEGER);

INSERT INTO Project (`project_id`, `employee_id`) VALUES
  ('1', '1'),
  ('1', '2'),
  ('1', '3'),
  ('2', '1'),
  ('2', '4');

DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (
  `employee_id` INTEGER,
  `name` VARCHAR(6),
  `experience_years` INTEGER);

INSERT INTO Employee (`employee_id`, `name`, `experience_years`) VALUES
  ('1', 'Khaled', '3'),
  ('2', 'Ali', '2'),
  ('3', 'John', '1'),
  ('4', 'Doe', '2');
  
-- Writing your MySQL query statement below
SELECT p.project_id, ROUND(AVG(e.experience_years), 2) AS average_years
FROM Project p LEFT JOIN Employee e 
ON p.employee_id = e.employee_id 
GROUP BY p.project_id

## 1076.[Easy] Project Employees II

***Write an SQL query that reports all the projects that have the most employees.***

Project table:
| project_id  | employee_id |
|:-----------:|:-----------:|
| 1           | 1           |
| 1           | 2           |
| 1           | 3           |
| 2           | 1           |
| 2           | 4           |

Employee table:
| employee_id | name   | experience_years |
|:-----------:|:------:|:----------------:|
| 1           | Khaled | 3                |
| 2           | Ali    | 2                |
| 3           | John   | 1                |
| 4           | Doe    | 2                |

Result table:
| project_id  |
|:-----------:|
| 1           |

The first project has 3 employees while the second one has 2.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Project;
CREATE TABLE Project (
  `project_id` INTEGER,
  `employee_id` INTEGER);

INSERT INTO Project (`project_id`, `employee_id`) VALUES
  ('1', '1'),
  ('1', '2'),
  ('1', '3'),
  ('2', '1'),
  ('2', '4');

CREATE TABLE Employee (
  `employee_id` INTEGER,
  `name` VARCHAR(6),
  `experience_years` INTEGER);

INSERT INTO Employee (`employee_id`, `name`, `experience_years`) VALUES
  ('1', 'Khaled', '3'),
  ('2', 'Ali', '2'),
  ('3', 'John', '1'),
  ('4', 'Doe', '2');
  
-- Writing your MySQL query statement below
SELECT project_id
FROM Project
GROUP BY project_id
HAVING COUNT(employee_id) = (SELECT COUNT(employee_id)
							 FROM Project
							 GROUP BY project_id
							 ORDER BY COUNT(employee_id) DESC
							 LIMIT 1);

## 1077.[Medium] Project Employees III

***Write an SQL query that reports the most experienced employees in each project. 
In case of a tie, report all employees with the maximum number of experience years.***

Project table:
| project_id  | employee_id |
|:-----------:|:-----------:|
| 1           | 1           |
| 1           | 2           |
| 1           | 3           |
| 2           | 1           |
| 2           | 4           |

Employee table:
| employee_id | name   | experience_years |
|:-----------:|:------:|:----------------:|
| 1           | Khaled | 3                |
| 2           | Ali    | 2                |
| 3           | John   | 3                |
| 4           | Doe    | 2                |

Result table:
| project_id  | employee_id   |
|:-----------:|:-------------:|
| 1           | 1             |
| 1           | 3             |
| 2           | 1             |

Both employees with id 1 and 3 have the most experience among the employees of the first project. For the second project, the employee with id 1 has the most experience.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Project;
CREATE TABLE Project (
  `project_id` INTEGER,
  `employee_id` INTEGER);

INSERT INTO Project (`project_id`, `employee_id`) VALUES
  ('1', '1'),
  ('1', '2'),
  ('1', '3'),
  ('2', '1'),
  ('2', '4');

DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (
  `employee_id` INTEGER,
  `name` VARCHAR(6),
  `experience_years` INTEGER);

INSERT INTO Employee (`employee_id`, `name`, `experience_years`) VALUES
  ('1', 'Khaled', '3'),
  ('2', 'Ali', '2'),
  ('3', 'John', '3'),
  ('4', 'Doe', '2');

-- Writing your MySQL query statement below
SELECT project_id, employee_id
FROM (SELECT p.project_id, e.employee_id, e.name, e.experience_years, 
             RANK() OVER (PARTITION BY p.project_id ORDER BY e.experience_years DESC) AS yr
	  FROM Project p LEFT JOIN Employee e
	  ON p.employee_id = e.employee_id) t
WHERE yr = 1;

## 1082.[Easy] Sales Analysis I

***Write an SQL query that reports the best seller by total sales price, If there is a tie, report them all.***

Product table:
| product_id | product_name | unit_price |
|:----------:|:------------:|:----------:|
| 1          | S8           | 1000       |
| 2          | G4           | 800        |
| 3          | iPhone       | 1400       |

Sales table:
| seller_id | product_id | buyer_id | sale_date  | quantity | price |
|:---------:|:----------:|:--------:|:----------:|:--------:|:-----:|
| 1         | 1          | 1        | 2019-01-21 | 2        | 2000  |
| 1         | 2          | 2        | 2019-02-17 | 1        | 800   |
| 2         | 2          | 3        | 2019-06-02 | 1        | 800   |
| 3         | 3          | 4        | 2019-05-13 | 2        | 2800  |

Result table:
| seller_id   |
|:-----------:|
| 1           |
| 3           |

Both sellers with id 1 and 3 sold products with the most total price of 2800.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_id` INTEGER,
  `product_name` VARCHAR(6),
  `unit_price` INTEGER);

INSERT INTO Product (`product_id`, `product_name`, `unit_price`) VALUES
  ('1', 'S8', '1000'),
  ('2', 'G4', '800'),
  ('3', 'iPhone', '1400');

DROP TABLE IF EXISTS Sales;
CREATE TABLE Sales (
  `seller_id` INTEGER,
  `product_id` INTEGER,
  `buyer_id` INTEGER,
  `sale_date` DATETIME,
  `quantity` INTEGER,
  `price` INTEGER);

INSERT INTO Sales (`seller_id`, `product_id`, `buyer_id`, `sale_date`, `quantity`, `price`) VALUES
  ('1', '1', '1', '2019-01-21', '2', '2000'),
  ('1', '2', '2', '2019-02-17', '1', '800'),
  ('2', '2', '3', '2019-06-02', '1', '800'),
  ('3', '3', '4', '2019-05-13', '2', '2800');
  
-- Writing your MySQL query statement below
SELECT seller_id 
FROM Sales
GROUP BY seller_id
HAVING SUM(price) = (SELECT SUM(price)
					 FROM Sales
					 GROUP BY seller_id
                     ORDER BY SUM(price) DESC

## 1083.[Easy] Sales Analysis II

***Write an SQL query that reports the buyers who have bought S8 but not iPhone. 
Note that S8 and iPhone are products present in the Product table.***

Product table:
| product_id | product_name | unit_price |
|:----------:|:------------:|:----------:|
| 1          | S8           | 1000       |
| 2          | G4           | 800        |
| 3          | iPhone       | 1400       |

Sales table:
| seller_id | product_id | buyer_id | sale_date  | quantity | price |
|:---------:|:----------:|:--------:|:----------:|:--------:|:-----:|
| 1         | 1          | 1        | 2019-01-21 | 2        | 2000  |
| 1         | 2          | 2        | 2019-02-17 | 1        | 800   |
| 2         | 1          | 3        | 2019-06-02 | 1        | 800   |
| 3         | 3          | 3        | 2019-05-13 | 2        | 2800  |

Result table:
| buyer_id    |
|:-----------:|
| 1           |

The buyer with id 1 bought an S8 but didn't buy an iPhone. The buyer with id 3 bought both.

-- Creating SQL Schema
DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_id` INTEGER,
  `product_name` VARCHAR(6),
  `unit_price` INTEGER);

INSERT INTO Product (`product_id`, `product_name`, `unit_price`) VALUES
  ('1', 'S8', '1000'),
  ('2', 'G4', '800'),
  ('3', 'iPhone', '1400');

DROP TABLE IF EXISTS Sales;
CREATE TABLE Sales (
  `seller_id` INTEGER,
  `product_id` INTEGER,
  `buyer_id` INTEGER,
  `sale_date` DATETIME,
  `quantity` INTEGER,
  `price` INTEGER);

INSERT INTO Sales (`seller_id`, `product_id`, `buyer_id`, `sale_date`, `quantity`, `price`) VALUES
  ('1', '1', '1', '2019-01-21', '2', '2000'),
  ('1', '2', '2', '2019-02-17', '1', '800'),
  ('2', '1', '3', '2019-06-02', '1', '800'),
  ('3', '3', '3', '2019-05-13', '2', '2800');

-- Writing your MySQL query statement below
SELECT DISTINCT s.buyer_id
FROM Sales s LEFT JOIN Product p
ON s.product_id = p.product_id
WHERE p.product_name = "S8"
AND s.buyer_id NOT IN (SELECT s.buyer_id
					   FROM Sales s LEFT JOIN Product p
					   ON s.product_id = p.product_id
					   WHERE p.product_name IN ("G4", "iPhone"));

SELECT s.buyer_id
FROM Sales s LEFT JOIN Product p
ON s.product_id = p.product_id
GROUP BY buyer_id
HAVING SUM(product_name = 'S8') > 0 
AND SUM(product_name = 'G4') = 0
AND SUM(product_name = 'iPhone') = 0;

## 1084.[Easy] Sales Analysis III

***Write an SQL query that reports the products that were only sold in spring 2019. 
That is, between 2019-01-01 and 2019-03-31 inclusive.***

Product table:
| product_id | product_name | unit_price |
|:----------:|:------------:|:----------:|
| 1          | S8           | 1000       |
| 2          | G4           | 800        |
| 3          | iPhone       | 1400       |

Sales table:
| seller_id | product_id | buyer_id | sale_date  | quantity | price |
|:---------:|:----------:|:--------:|:----------:|:--------:|:-----:|
| 1         | 1          | 1        | 2019-01-21 | 2        | 2000  |
| 1         | 2          | 2        | 2019-02-17 | 1        | 800   |
| 2         | 2          | 3        | 2019-06-02 | 1        | 800   |
| 3         | 3          | 4        | 2019-05-13 | 2        | 2800  |

Result table:
| product_id  | product_name |
|:-----------:|:------------:|
| 1           | S8           |

The product with id 1 was only sold in spring 2019 while the other two were sold after.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Product;
CREATE TABLE Product (
  `product_id` INTEGER,
  `product_name` VARCHAR(6),
  `unit_price` INTEGER);

INSERT INTO Product (`product_id`, `product_name`, `unit_price`) VALUES
  ('1', 'S8', '1000'),
  ('2', 'G4', '800'),
  ('3', 'iPhone', '1400');

DROP TABLE IF EXISTS Sales;
CREATE TABLE Sales (
  `seller_id` INTEGER,
  `product_id` INTEGER,
  `buyer_id` INTEGER,
  `sale_date` DATETIME,
  `quantity` INTEGER,
  `price` INTEGER);

INSERT INTO Sales (`seller_id`, `product_id`, `buyer_id`, `sale_date`, `quantity`, `price`) VALUES
  ('1', '1', '1', '2019-01-21', '2', '2000'),
  ('1', '2', '2', '2019-02-17', '1', '800'),
  ('2', '2', '3', '2019-06-02', '1', '800'),
  ('3', '3', '4', '2019-05-13', '2', '2800');

-- Writing your MySQL query statement below
SELECT p.product_id, p.product_name 
FROM Product p LEFT JOIN Sales s
ON p.product_id = s.product_id 
GROUP BY p.product_id, p.product_name 
HAVING MIN(s.sale_date) >= "2019-01-01" AND MAX(s.sale_date) <= "2019-03-31";

## 1097.[Hard] Game Play Analysis V

***Write an SQL query that reports for each install date, the number of players that installed the game on that day and the day 1 retention.***

Activity table:
| player_id | device_id | event_date | games_played |
|:---------:|:---------:|:----------:|:------------:|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-01 | 0            |
| 3         | 4         | 2016-07-03 | 5            |

Result table:
| install_dt | installs | Day1_retention |
|:----------:|:--------:|:--------------:|
| 2016-03-01 | 2        | 0.50           |
| 2017-06-25 | 1        | 0.00           |

Player 1 and 3 installed the game on 2016-03-01 but only player 1 logged back in on 2016-03-02 so the day 1 retention of 2016-03-01 is 1 / 2 = 0.50
Player 2 installed the game on 2017-06-25 but didn't log back in on 2017-06-26 so the day 1 retention of 2017-06-25 is 0 / 1 = 0.00

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (
  `player_id` INTEGER,
  `device_id` INTEGER,
  `event_date` DATETIME,
  `games_played` INTEGER);

INSERT INTO Activity (`player_id`, `device_id`, `event_date`, `games_played`) VALUES
  ('1', '2', '2016-03-01', '5'),
  ('1', '2', '2016-03-02', '6'),
  ('2', '3', '2017-06-25', '1'),
  ('3', '1', '2016-03-01', '0'),
  ('3', '4', '2016-07-03', '5');
  
-- Writing your MySQL query statement below
SELECT CAST(t1.event_date AS DATE) AS install_dt, COUNT(t1.player_id) AS installs, ROUND(COUNT(t3.player_id)/COUNT(t1.player_id), 2) AS Day1_retention
FROM Activity t1 LEFT JOIN Activity t2 
ON t1.player_id = t2.player_id AND t1.event_date > t2.event_date LEFT JOIN Activity t3
ON t1.player_id = t3.player_id AND DATEDIFF(t3.event_date, t1.event_date) = 1
WHERE t2.event_date IS NULL 
GROUP BY t1.event_date;

## 1098.[Medium] Unpopular Books

***Write an SQL query that reports the books that have sold less than 10 copies in the last year, excluding books that have been available for less than 1 month from today. Assume today is 2019-06-23.***

Books table:
| book_id | name               | available_from |
|:-------:|:------------------:|:--------------:|
| 1       | "Kalila And Demna" | 2010-01-01     |
| 2       | "28 Letters"       | 2012-05-12     |
| 3       | "The Hobbit"       | 2019-06-10     |
| 4       | "13 Reasons Why"   | 2019-06-01     |
| 5       | "The Hunger Games" | 2008-09-21     |

Orders table:
| order_id | book_id | quantity | dispatch_date |
|:--------:|:-------:|:--------:|:-------------:|
| 1        | 1       | 2        | 2018-07-26    |
| 2        | 1       | 1        | 2018-11-05    |
| 3        | 3       | 8        | 2019-06-11    |
| 4        | 4       | 6        | 2019-06-05    |
| 5        | 4       | 5        | 2019-06-20    |
| 6        | 5       | 9        | 2009-02-02    |
| 7        | 5       | 8        | 2010-04-13    |

Result table:
| book_id   | name               |
|:---------:|:------------------:|
| 1         | "Kalila And Demna" |
| 2         | "28 Letters"       |
| 5         | "The Hunger Games" |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Books;
CREATE TABLE Books (
  `book_id` INTEGER,
  `name` VARCHAR(18),
  `available_from` DATETIME);

INSERT INTO Books (`book_id`, `name`, `available_from`) VALUES
  ('1', 'Kalila And Demna', '2010-01-01'),
  ('2', '28 Letters', '2012-05-12'),
  ('3', 'The Hobbit', '2019-06-10'),
  ('4', '13 Reasons Why', '2019-06-01'),
  ('5', 'The Hunger Games', '2008-09-21');

DROP TABLE IF EXISTS Orders;
CREATE TABLE Orders (
  `order_id` INTEGER,
  `book_id` INTEGER,
  `quantity` INTEGER,
  `dispatch_date` DATETIME);

INSERT INTO Orders (`order_id`, `book_id`, `quantity`, `dispatch_date`) VALUES
  ('1', '1', '2', '2018-07-26'),
  ('2', '1', '1', '2018-11-05'),
  ('3', '3', '8', '2019-06-11'),
  ('4', '4', '6', '2019-06-05'),
  ('5', '4', '5', '2019-06-20'),
  ('6', '5', '9', '2009-02-02'),
  ('7', '5', '8', '2010-04-13');
  
-- Writing your MySQL query statement below
#
SELECT b.book_id, b.name
FROM Books b LEFT JOIN Orders o
ON b.book_id = o.book_id
WHERE DATE_ADD(b.available_from, INTERVAL 1 MONTH) < "2019-06-23"
GROUP BY b.book_id, b.name
HAVING SUM(CASE WHEN DATE_ADD(o.dispatch_date, INTERVAL 1 YEAR) > '2019-06-23'
                THEN o.quantity
                ELSE 0 END) < 10;
-- HAVING SUM(IF(DATE_ADD(o.dispatch_date, INTERVAL 1 YEAR) > "2019-06-23", o.quantity, 0)) < 10;
##
SELECT b.book_id, b.name
FROM Books b LEFT JOIN (SELECT book_id, SUM(quantity) AS sold
						FROM Orders
                        WHERE dispatch_date BETWEEN "2018-06-23" AND "2019-06-23"
                        GROUP BY book_id) t
ON b.book_id = t.book_id
WHERE IFNULL(sold, 0) <= 10 AND available_from < DATE_SUB("2019-06-23", INTERVAL 1 MONTH);
###
SELECT book_id, name 
FROM Books
WHERE available_from < DATE_SUB("2019-06-23", INTERVAL 1 MONTH) 
AND book_id NOT IN (SELECT book_id
					FROM Orders 
                    WHERE dispatch_date > DATE_SUB("2019-06-23", INTERVAL 1 YEAR));

## 1107.[Medium] New Users Daily Count

***Write an SQL query that reports for every date within at most 90 days from today, 
the number of users that logged in for the first time on that date. Assume today is 2019-06-30.***

Traffic table:
| user_id | activity | activity_date |
|:-------:|:--------:|:-------------:|
| 1       | login    | 2019-05-01    |
| 1       | homepage | 2019-05-01    |
| 1       | logout   | 2019-05-01    |
| 2       | login    | 2019-06-21    |
| 2       | logout   | 2019-06-21    |
| 3       | login    | 2019-01-01    |
| 3       | jobs     | 2019-01-01    |
| 3       | logout   | 2019-01-01    |
| 4       | login    | 2019-06-21    |
| 4       | groups   | 2019-06-21    |
| 4       | logout   | 2019-06-21    |
| 5       | login    | 2019-03-01    |
| 5       | logout   | 2019-03-01    |
| 5       | login    | 2019-06-21    |
| 5       | logout   | 2019-06-21    |

Result table:
| login_date | user_count  |
|:----------:|:-----------:|
| 2019-05-01 | 1           |
| 2019-06-21 | 2           |

Note that we only care about dates with non zero user count.
The user with id 5 first logged in on 2019-03-01 so he's not counted on 2019-06-21.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Traffic;
CREATE TABLE Traffic (
  `user_id` INTEGER,
  `activity` VARCHAR(8),
  `activity_date` DATETIME);

INSERT INTO Traffic (`user_id`, `activity`, `activity_date`) VALUES
  ('1', 'login', '2019-05-01'),
  ('1', 'homepage', '2019-05-01'),
  ('1', 'logout', '2019-05-01'),
  ('2', 'login', '2019-06-21'),
  ('2', 'logout', '2019-06-21'),
  ('3', 'login', '2019-01-01'),
  ('3', 'jobs', '2019-01-01'),
  ('3', 'logout', '2019-01-01'),
  ('4', 'login', '2019-06-21'),
  ('4', 'groups', '2019-06-21'),
  ('4', 'logout', '2019-06-21'),
  ('5', 'login', '2019-03-01'),
  ('5', 'logout', '2019-03-01'),
  ('5', 'login', '2019-06-21'),
  ('5', 'logout', '2019-06-21');
  
-- Writing your MySQL query statement below
SELECT login_date, COUNT(DISTINCT user_id) AS user_count
FROM (SELECT user_id, CAST(MIN(activity_date) AS DATE) AS login_date
	  FROM Traffic
	  WHERE activity = 'login'
	  GROUP BY user_id) t
WHERE DATEDIFF("2019-06-30", login_date) <= 90
GROUP BY login_date
ORDER BY login_date;

## 1112.[Medium] Highest Grade For Each Student

***Write a SQL query to find the highest grade with its corresponding course for each student. 
In case of a tie, you should find the course with the smallest course_id. The output must be sorted by increasing student_id.***

Enrollments table:
| student_id | course_id | grade |
|:----------:|:---------:|:-----:|
| 2          | 2         | 95    |
| 2          | 3         | 95    |
| 1          | 1         | 90    |
| 1          | 2         | 99    |
| 3          | 1         | 80    |
| 3          | 2         | 75    |
| 3          | 3         | 82    |

Result table:
| student_id | course_id | grade |
|:----------:|:---------:|:-----:|
| 1          | 2         | 99    |
| 2          | 2         | 95    |
| 3          | 3         | 82    |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Enrollments;
CREATE TABLE Enrollments (
  `student_id` INTEGER,
  `course_id` INTEGER,
  `grade` INTEGER);

INSERT INTO Enrollments (`student_id`, `course_id`, `grade`) VALUES
  ('2', '2', '95'),
  ('2', '3', '95'),
  ('1', '1', '90'),
  ('1', '2', '99'),
  ('3', '1', '80'),
  ('3', '2', '75'),
  ('3', '3', '82');
  
-- Writing your MySQL query statement below
#
SELECT student_id, course_id, grade
FROM (SELECT student_id, course_id, MAX(grade) AS grade, 
	         ROW_NUMBER() OVER (PARTITION BY student_id ORDER BY MAX(grade) DESC, course_id ASC) AS rk
	  FROM Enrollments
	  GROUP BY student_id, course_id) t
WHERE rk = 1;
##
SELECT student_id, MIN(course_id) AS course_id, grade 
FROM Enrollments
WHERE (student_id, grade) IN (SELECT student_id, MAX(grade) AS grade
							  FROM Enrollments 
                              GROUP BY student_id)
GROUP BY student_id, grade
ORDER BY student_id ASC;

## 1113.[Easy] Reported Posts

***Write an SQL query that reports the number of posts reported yesterday for each report reason. Assume today is 2019-07-05.***

Actions table:
| user_id | post_id | action_date | action | extra  |
|:-------:|:-------:|:-----------:|:------:|:------:|
| 1       | 1       | 2019-07-01  | view   | null   |
| 1       | 1       | 2019-07-01  | like   | null   |
| 1       | 1       | 2019-07-01  | share  | null   |
| 2       | 4       | 2019-07-04  | view   | null   |
| 2       | 4       | 2019-07-04  | report | spam   |
| 3       | 4       | 2019-07-04  | view   | null   |
| 3       | 4       | 2019-07-04  | report | spam   |
| 4       | 3       | 2019-07-02  | view   | null   |
| 4       | 3       | 2019-07-02  | report | spam   |
| 5       | 2       | 2019-07-04  | view   | null   |
| 5       | 2       | 2019-07-04  | report | racism |
| 5       | 5       | 2019-07-04  | view   | null   |
| 5       | 5       | 2019-07-04  | report | racism |

Result table:
| report_reason | report_count |
|:-------------:|:------------:|
| spam          | 1            |
| racism        | 2            |
 
Note that we only care about report reasons with non zero number of reports.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Actions;
CREATE TABLE Actions (
  `user_id` INTEGER,
  `post_id` INTEGER,
  `action_date` DATETIME,
  `action` VARCHAR(6),
  `extra` VARCHAR(6));

INSERT INTO Actions (`user_id`, `post_id`, `action_date`, `action`, `extra`) VALUES
  ('1', '1', '2019-07-01', 'view', 'null'),
  ('1', '1', '2019-07-01', 'like', 'null'),
  ('1', '1', '2019-07-01', 'share', 'null'),
  ('2', '4', '2019-07-04', 'view', 'null'),
  ('2', '4', '2019-07-04', 'report', 'spam'),
  ('3', '4', '2019-07-04', 'view', 'null'),
  ('3', '4', '2019-07-04', 'report', 'spam'),
  ('4', '3', '2019-07-02', 'view', 'null'),
  ('4', '3', '2019-07-02', 'report', 'spam'),
  ('5', '2', '2019-07-04', 'view', 'null'),
  ('5', '2', '2019-07-04', 'report', 'racism'),
  ('5', '5', '2019-07-04', 'view', 'null'),
  ('5', '5', '2019-07-04', 'report', 'racism');
  
-- Writing your MySQL query statement below
SELECT extra AS report_reason, COUNT(DISTINCT post_id) AS report_count
FROM Actions
WHERE DATEDIFF('2019-07-05', action_date) = 1 
AND action = "report"
AND extra != "null"
GROUP BY report_reason;

## 1126.[Medium] Active Businesses

***Write an SQL query to find all active businesses. An active business is a business that has more than one event type with occurences greater than the average occurences of that event type among all businesses.***

Events table:
| business_id | event_type | occurences |
|:-----------:|:----------:|:----------:|
| 1           | reviews    | 7          |
| 3           | reviews    | 3          |
| 1           | ads        | 11         |
| 2           | ads        | 7          |
| 3           | ads        | 6          |
| 1           | page views | 3          |
| 2           | page views | 12         |

Result table:
| business_id |
|:-----------:|
| 1           |
 
Average for 'reviews', 'ads' and 'page views' are (7+3)/2=5, (11+7+6)/3=8, (3+12)/2=7.5 respectively. <br/>
Business with id 1 has 7 'reviews' events (more than 5) and 11 'ads' events (more than 8) so it is an active business.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Events;
CREATE TABLE Events (
  `business_id` INTEGER,
  `event_type` VARCHAR(10),
  `occurences` INTEGER);

INSERT INTO Events (`business_id`, `event_type`, `occurences`) VALUES
  ('1', 'reviews', '7'),
  ('3', 'reviews', '3'),
  ('1', 'ads', '11'),
  ('2', 'ads', '7'),
  ('3', 'ads', '6'),
  ('1', 'page views', '3'),
  ('2', 'page views', '12');
  
-- Writing your MySQL query statement below
#
SELECT b.business_id
FROM Events b LEFT JOIN (SELECT event_type, CAST(AVG(occurences) AS FLOAT) AS avg_occurences
						 FROM Events
						 GROUP BY event_type) t
ON b.event_type = t.event_type
GROUP BY business_id
HAVING SUM(IF(b.occurences > t.avg_occurences, 1, 0)) > 1;
##
SELECT business_id
FROM (SELECT *, AVG(CAST(occurences AS FLOAT)) OVER (PARTITION BY event_type) AS avg_occurences
	  FROM Events) t
GROUP BY business_id
HAVING SUM(IF(occurences > avg_occurences, 1, 0)) > 1;

## 1127.[Hard] User Purchase Platform

***Write an SQL query to find the total number of users and the total amount spent using mobile only, desktop only and both mobile and desktop together for each date.***

Spending table:
| user_id | spend_date | platform | amount |
|:-------:|:----------:|:--------:|:------:|
| 1       | 2019-07-01 | mobile   | 100    |
| 1       | 2019-07-01 | desktop  | 100    |
| 2       | 2019-07-01 | mobile   | 100    |
| 2       | 2019-07-02 | mobile   | 100    |
| 3       | 2019-07-01 | desktop  | 100    |
| 3       | 2019-07-02 | desktop  | 100    |

Result table:
| spend_date | platform | total_amount | total_users |
|:----------:|:--------:|:------------:|:-----------:|
| 2019-07-01 | desktop  | 100          | 1           |
| 2019-07-01 | mobile   | 100          | 1           |
| 2019-07-01 | both     | 200          | 1           |
| 2019-07-02 | desktop  | 100          | 1           |
| 2019-07-02 | mobile   | 100          | 1           |
| 2019-07-02 | both     | 0            | 0           |
 
On 2019-07-01, user 1 purchased using both desktop and mobile, user 2 purchased using mobile only and user 3 purchased using desktop only.<br/>
On 2019-07-02, user 2 purchased using mobile only, user 3 purchased using desktop only and no one purchased using both platforms.

## 1132.[Medium] Reported Posts II

***Write an SQL query to find the average for daily percentage of posts that got removed after being reported as spam, rounded to 2 decimal places.***

Actions table:
| user_id | post_id | action_date | action | extra  |
|:-------:|:-------:|:-----------:|:------:|:------:|
| 1       | 1       | 2019-07-01  | view   | null   |
| 1       | 1       | 2019-07-01  | like   | null   |
| 1       | 1       | 2019-07-01  | share  | null   |
| 2       | 2       | 2019-07-04  | view   | null   |
| 2       | 2       | 2019-07-04  | report | spam   |
| 3       | 4       | 2019-07-04  | view   | null   |
| 3       | 4       | 2019-07-04  | report | spam   |
| 4       | 3       | 2019-07-02  | view   | null   |
| 4       | 3       | 2019-07-02  | report | spam   |
| 5       | 2       | 2019-07-03  | view   | null   |
| 5       | 2       | 2019-07-03  | report | racism |
| 5       | 5       | 2019-07-03  | view   | null   |
| 5       | 5       | 2019-07-03  | report | racism |

Removals table:
| post_id | remove_date |
|:-------:|:-----------:|
| 2       | 2019-07-20  |
| 3       | 2019-07-18  |

Result table:
| average_daily_percent |
|:---------------------:|
| 75.00                 |

The percentage for 2019-07-04 is 50% because only one post of two spam reported posts was removed.<br/>
The percentage for 2019-07-02 is 100% because one post was reported as spam and it was removed.<br/>
The other days had no spam reports so the average is (50 + 100) / 2 = 75%<br/>
Note that the output is only one number and that we do not care about the remove dates.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Actions;
CREATE TABLE Actions (
  `user_id` INTEGER,
  `post_id` INTEGER,
  `action_date` DATETIME,
  `action` VARCHAR(6),
  `extra` VARCHAR(6));

INSERT INTO Actions (`user_id`, `post_id`, `action_date`, `action`, `extra`) VALUES
  ('1', '1', '2019-07-01', 'view', 'null'),
  ('1', '1', '2019-07-01', 'like', 'null'),
  ('1', '1', '2019-07-01', 'share', 'null'),
  ('2', '2', '2019-07-04', 'view', 'null'),
  ('2', '2', '2019-07-04', 'report', 'spam'),
  ('3', '4', '2019-07-04', 'view', 'null'),
  ('3', '4', '2019-07-04', 'report', 'spam'),
  ('4', '3', '2019-07-02', 'view', 'null'),
  ('4', '3', '2019-07-02', 'report', 'spam'),
  ('5', '2', '2019-07-03', 'view', 'null'),
  ('5', '2', '2019-07-03', 'report', 'racism'),
  ('5', '5', '2019-07-03', 'view', 'null'),
  ('5', '5', '2019-07-03', 'report', 'racism');

DROP TABLE IF EXISTS Removals;
CREATE TABLE Removals (
  `post_id` INTEGER,
  `remove_date` DATETIME);

INSERT INTO Removals (`post_id`, `remove_date`) VALUES
  ('2', '2019-07-20'),
  ('3', '2019-07-18');

-- Writing your MySQL query statement below
SELECT IFNULL(ROUND(SUM(remove_count/spam_count * 100)/COUNT(DISTINCT action_date), 2), 0) AS average_daily_percent 
FROM (SELECT action_date, COUNT(DISTINCT a.post_id) AS spam_count, COUNT(DISTINCT r.post_id) AS remove_COUNT
	  FROM Actions a LEFT JOIN Removals r 
	  ON a.post_id = r.post_id
	  WHERE a.extra = 'spam'
	  GROUP BY a.action_date) t;

## 1141.[Easy] User Activity for the Past 30 Days I

***Write an SQL query to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. 
A user was active on some day if he/she made at least one activity on that day.***

Activity table:
| user_id | session_id | activity_date | activity_type |
|:-------:|:----------:|:-------------:|:-------------:|
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |

Result table: 
| day        | active_users |
|:----------:|:------------:|
| 2019-07-20 | 2            |
| 2019-07-21 | 2            |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (
  `user_id` INTEGER,
  `session_id` INTEGER,
  `activity_date` DATETIME,
  `activity_type` VARCHAR(12));

INSERT INTO Activity (`user_id`, `session_id`, `activity_date`, `activity_type`) VALUES
  ('1', '1', '2019-07-20', 'open_session'),
  ('1', '1', '2019-07-20', 'scroll_down'),
  ('1', '1', '2019-07-20', 'end_session'),
  ('2', '4', '2019-07-20', 'open_session'),
  ('2', '4', '2019-07-21', 'send_message'),
  ('2', '4', '2019-07-21', 'end_session'),
  ('3', '2', '2019-07-21', 'open_session'),
  ('3', '2', '2019-07-21', 'send_message'),
  ('3', '2', '2019-07-21', 'end_session'),
  ('4', '3', '2019-06-25', 'open_session'),
  ('4', '3', '2019-06-25', 'end_session');
  
-- Writing your MySQL query statement below
SELECT DATE(activity_date) AS day, COUNT(DISTINCT user_id) AS active_users
FROM Activity
WHERE DATEDIFF("2019-07-27", activity_date) < 30 
AND activity_date <= "2019-07-27"
GROUP BY activity_date

## 1142.[Easy] User Activity for the Past 30 Days II

***Write an SQL query to find the average number of sessions per user for a period of 30 days ending 2019-07-27 inclusively, rounded to 2 decimal places. 
The sessions we want to count for a user are those with at least one activity in that time period.***

Activity table:
| user_id | session_id | activity_date | activity_type |
|:-------:|:----------:|:-------------:|:-------------:|
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 3       | 5          | 2019-07-21    | open_session  |
| 3       | 5          | 2019-07-21    | scroll_down   |
| 3       | 5          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |

Result table:
| average_sessions_per_user |
|:-------------------------:|
| 1.33                      |

User 1 and 2 each had 1 session in the past 30 days while user 3 had 2 sessions so the average is (1 + 1 + 2) / 3 = 1.33.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Activity;
CREATE TABLE Activity (
  `user_id` INTEGER,
  `session_id` INTEGER,
  `activity_date` DATETIME,
  `activity_type` VARCHAR(12));

INSERT INTO Activity (`user_id`, `session_id`, `activity_date`, `activity_type`) VALUES
  ('1', '1', '2019-07-20', 'open_session'),
  ('1', '1', '2019-07-20', 'scroll_down'),
  ('1', '1', '2019-07-20', 'end_session'),
  ('2', '4', '2019-07-20', 'open_session'),
  ('2', '4', '2019-07-21', 'send_message'),
  ('2', '4', '2019-07-21', 'end_session'),
  ('3', '2', '2019-07-21', 'open_session'),
  ('3', '2', '2019-07-21', 'send_message'),
  ('3', '2', '2019-07-21', 'end_session'),
  ('3', '5', '2019-07-21', 'open_session'),
  ('3', '5', '2019-07-21', 'scroll_down'),
  ('3', '5', '2019-07-21', 'end_session'),
  ('4', '3', '2019-06-25', 'open_session'),
  ('4', '3', '2019-06-25', 'end_session');
  
-- Writing your MySQL query statement below
SELECT DISTINCT user_id, COUNT(DISTINCT session_id) AS active_users
FROM Activity
WHERE DATEDIFF("2019-07-27", activity_date) < 30 
AND activity_date <= "2019-07-27"
GROUP BY user_id;

SELECT IFNULL(ROUND(COUNT(DISTINCT session_id)/COUNT(DISTINCT user_id), 2), 0) AS average_sessions_per_user
FROM Activity
WHERE DATEDIFF("2019-07-27", activity_date) < 30 
AND activity_date <= "2019-07-27";

## 1148.[Easy] Article Views I

***Write an SQL query to find all the authors that viewed at least one of their own articles, sorted in ascending order by their id.***

Views table:
| article_id | author_id | viewer_id | view_date  |
|:----------:|:---------:|:---------:|:----------:|
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |

Result table:
| id   |
|:----:|
| 4    |
| 7    |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Views;
CREATE TABLE Views (
  `article_id` INTEGER,
  `author_id` INTEGER,
  `viewer_id` INTEGER,
  `view_date` DATETIME);

INSERT INTO Views (`article_id`, `author_id`, `viewer_id`, `view_date`) VALUES
  ('1', '3', '5', '2019-08-01'),
  ('1', '3', '6', '2019-08-02'),
  ('2', '7', '7', '2019-08-01'),
  ('2', '7', '6', '2019-08-02'),
  ('4', '7', '1', '2019-07-22'),
  ('3', '4', '4', '2019-07-21'),
  ('3', '4', '4', '2019-07-21');

-- Writing your MySQL query statement below
SELECT author_id AS id
FROM Views
WHERE author_id = viewer_id
GROUP BY author_id
HAVING COUNT(viewer_id) >= 1
ORDER BY author_id ASC;

## 1149.[Medium] Article Views II

***Write an SQL query to find all the people who viewed more than one article on the same date, sorted in ascending order by their id.***

Views table:
| article_id | author_id | viewer_id | view_date  |
|:----------:|:---------:|:---------:|:----------:|
| 1          | 3         | 5         | 2019-08-01 |
| 3          | 4         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |

Result table:
| id   |
|:----:|
| 5    |
| 6    |

## 1173.[Easy] Immediate Food Delivery I

***Write an SQL query to find the percentage of immediate orders in the table, rounded to 2 decimal places.
If the preferred delivery date of the customer is the same as the order date then the order is called immediate otherwise its called scheduled.***

Delivery table:
| delivery_id | customer_id | order_date | customer_pref_delivery_date |
|:-----------:|:-----------:|:----------:|:---------------------------:|
| 1           | 1           | 2019-08-01 | 2019-08-02                  |
| 2           | 5           | 2019-08-02 | 2019-08-02                  |
| 3           | 1           | 2019-08-11 | 2019-08-11                  |
| 4           | 3           | 2019-08-24 | 2019-08-26                  |
| 5           | 4           | 2019-08-21 | 2019-08-22                  |
| 6           | 2           | 2019-08-11 | 2019-08-13                  |

Result table:
| immediate_percentage |
|:--------------------:|
| 33.33                |

The orders with delivery id 2 and 3 are immediate while the others are scheduled.

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Delivery;
CREATE TABLE Delivery (
  `delivery_id` INTEGER,
  `customer_id` INTEGER,
  `order_date` DATETIME,
  `customer_pref_delivery_date` DATETIME);

INSERT INTO Delivery (`delivery_id`, `customer_id`, `order_date`, `customer_pref_delivery_date`) VALUES
  ('1', '1', '2019-08-01', '2019-08-02'),
  ('2', '5', '2019-08-02', '2019-08-02'),
  ('3', '1', '2019-08-11', '2019-08-11'),
  ('4', '3', '2019-08-24', '2019-08-26'),
  ('5', '4', '2019-08-21', '2019-08-22'),
  ('6', '2', '2019-08-11', '2019-08-13');
  
-- Writing your MySQL query statement below
SELECT IFNULL(ROUND((SELECT COUNT(delivery_id)
					 FROM Delivery
					 WHERE order_date = customer_pref_delivery_date)
                     /COUNT(delivery_id)*100, 2), 0) AS immediate_percentage
FROM Delivery

## 1179.[Easy] Reformat Department Table

***Write an SQL query to reformat the table such that there is a department id column and a revenue column for each month.***

Department table:
| id   | revenue | month |
|:----:|:-------:|:-----:|
| 1    | 8000    | Jan   |
| 2    | 9000    | Jan   |
| 3    | 10000   | Feb   |
| 1    | 7000    | Feb   |
| 1    | 6000    | Mar   |

Result table:
| id   | Jan_Revenue | Feb_Revenue | Mar_Revenue | ... | Dec_Revenue |
|:----:|:-----------:|:-----------:|:-----------:|:---:|:-----------:|
| 1    | 8000        | 7000        | 6000        | ... | null        |
| 2    | 9000        | null        | null        | ... | null        |
| 3    | null        | 10000       | null        | ... | null        |

In [ ]:
-- Creating SQL Schema
DROP TABLE IF EXISTS Department;
CREATE TABLE Department (
  `id` INTEGER,
  `revenue` INTEGER,
  `month` VARCHAR(3));

INSERT INTO Department (`id`, `revenue`, `month`) VALUES
  ('1', '8000', 'Jan'),
  ('2', '9000', 'Jan'),
  ('3', '10000', 'Feb'),
  ('1', '7000', 'Feb'),
  ('1', '6000', 'Mar');
  
-- Writing your MySQL query statement below
SELECT id,
    SUM(CASE month WHEN 'Jan' THEN revenue END) AS Jan_Revenue,
    SUM(CASE month WHEN 'Feb' THEN revenue END) AS Feb_Revenue,
    SUM(CASE month WHEN 'Mar' THEN revenue END) AS Mar_Revenue,
    SUM(CASE month WHEN 'Apr' THEN revenue END) AS Apr_Revenue,
    SUM(CASE month WHEN 'May' THEN revenue END) AS May_Revenue,
    SUM(CASE month WHEN 'Jun' THEN revenue END) AS Jun_Revenue,
    SUM(CASE month WHEN 'Jul' THEN revenue END) AS Jul_Revenue,
    SUM(CASE month WHEN 'Aug' THEN revenue END) AS Aug_Revenue,
    SUM(CASE month WHEN 'Sep' THEN revenue END) AS Sep_Revenue,
    SUM(CASE month WHEN 'Oct' THEN revenue END) AS Oct_Revenue,
    SUM(CASE month WHEN 'Nov' THEN revenue END) AS Nov_Revenue,
    SUM(CASE month WHEN 'Dec' THEN revenue END) AS Dec_Revenue
FROM Department
GROUP BY id;